Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

# errorWhileUnblockPinNI
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين.(Err-108)

# errorWhileGettingAccountDetailsA2A
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-109)

# purposeDetailsNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-110)

# errorCustomerByAccountA2A
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-111)

# errorWhileRTPA2A
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-112)

# invalidAccount
source: Invalid account. Please try another account
ar: خطأ في الحساب. حاول مرة ثانية.

# errorWhileGettingAccountBS
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-114)

# invalidAmount
source: The amount you've entered exceeds your account balance. Please add money to your account or choose another amount.
ar: الرقم اللي أدخلته أكبر من رصيد حسابك. الرجاء إيداع المبلغ بالحساب أو اختيار مبلغ آخر.

# errorMultibranchAPIBS
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-116)

# transferTypeNF
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-117)

# transferTypeNFRTP
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-118)

# invalidIdNo
source: The national ID number you entered is invalid. Please enter a valid ID number and try again.
ar: الرقم الوطني غير صحيح. أدخل الرقم الصحيح وحاول كمان مرة.

# invalidExpiryDate
source: The ID expiry date you entered is incorrect. Please enter the correct date and try again.
ar: تاريخ انتهاء الهوية غير صحيح. أدخل التاريخ الصحيح وحاول كمان مرة.

# errorAddingUserName
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# registrationProcessError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-002)

# ahwalError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-003)

# kycStausError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-004)

# savingIdCardError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-005)

# savingCountryResidenceError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-006)

# savingProfileStatusError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-007)

# savingJobDetailsError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-008)

# addAccountPurposeError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-009)

# fatcaCrsError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# uploadFatcaSignatureError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-011)

# savingFatcaDetailsError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-012)

# savingW8FormError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-013)

# savingW9FormError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-014)

# selfieCheckError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-015)

# enableFingerPrintError
source: An error occurred while enabling biometric login. Please try again later.
ar: خطأ خلال تفعيل التسجيل بالبصمة. حاول كمان مرة بعدين.

# disableFingerPrintError
source: An error occurred while disabling biometric login. Please try again later.
ar: خطأ خلال تعطيل التسجيل بالبصمة. حاول كمان مرة بعدين.

# getComboValuesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getAdditionalDocumentationError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# saveAdditionalDocumentationError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getAccountDetailsError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-021)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Ex-021)

# creatingAccountError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-022)
ar: عفواً! مش قادرين نفتح حسابك. حاول كمان مرة أو تواصل معنا من خلال التطبيق أو على 5200100-06 (Ex-022)

# checkVideoCallStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkOtherNationalityStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# uploadDocumentsError
source: An error occurred while uploading documents. Please try again later.
ar: خطأ خلال تحميل الوثائق. حاول كمان مرة بعدين.

# logoutError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# registerInterestError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyOtpError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# iphoneLoginError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkDocumentStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkAgentStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# changeCallStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# saveCustomerTimeStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getAllowedCountriesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCountriesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# removeDebitLockError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# enableBiometricError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCipherError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# generateKeyPairError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# androidLoginError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkCustomerStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getBeneficiariesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getAtmError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkIssuer
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getStatesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCitiesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCitiesByCountryError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getContactsError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# addBeneficiaryError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# updateBeneficiaryError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# deleteBeneficiaryError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyBeneficiaryOtpError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# uploadBeneficiaryError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getProfileInfoError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# deleteProfileImageError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCustomerDocumentError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCustomerDocumentIdError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# changeProfileImageError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# changeEmailError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyChangeEmailError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# changeMobileNoError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyChangeMobileNoError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# changePasswordError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyOtpPasswordError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# requestToPayStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# cardIssuanceError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# setCardPintError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# confirmDeliveryError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getDashboardDataError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# moneyThorError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# debitCardTransactionListError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# accountActivityError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# confrimCreditCardDeliveryError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# creditDashboardDataError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# creditCardReqError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# creditCardTransactionListError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCreditYearsError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# creditCardStatementError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getDebitYearsError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# debitCardStatementError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# updateLimitError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# freezeDebitCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# unfreezeDebitCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# cancelDebitCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyChangePinError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# changePinError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# unblockDebitCardPinError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getDebitCardLimitError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# requestSupplementaryDebitCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# freezeCreditCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# unfreezeCreditCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# unblockCreditCardPinError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getAccountByAliasError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# requestToPayError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkSendMoneyError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyTransferApiError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyTransferApiV2Error
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getTransferPurposeError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# paymentActivityApiError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkCredentialsForForgetPasswordError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# forgetPasswordError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyForgetPasswordError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# sendOtpTokenError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# verifyDeviceChangeOtpError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# resendOtpError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkExistingCallError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# requestCallError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getGenderStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getTimeSlotsError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# addCallError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# checkCallStatusError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCardApplicationError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getLoanValuesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# processLoanValuesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# paybackCreditCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# supplementaryCardApplicationError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# requestSupplementaryCardError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# supplementaryCardStep2Error
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# supplementaryCardStep3Error
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# relationshipListError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# getCurrentValuesError
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! خطأ بالاتصال. حاول كمان مرة بعدين.

# expiryDateError
source: Invalid Expiry Date
ar: تاريخ إنتهاء غير صالح

# passwordMismatchError
source: The passwords you entered do not match. Please check and try again.
ar: كلمة المرور غير مطابقة. حاول كمان مرة.

# sendingDeviceOtpError
source: An error has occurred in sending the code. Please try again later or contact our Engagement Team on 06-5200100.
ar: خطأ خلال إرسال الرمز. حاول كمان مرة بعدين أو تواصل معنا على 5200100-06
