Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Bills History
ar: سِجِل الفواتير

# rejectedDueToExpiryDate
source: Payment cannot be completed because the bill is expired.
ar: تم رفض دفع الفاتوره بسبب انتهاء صلاحية الفاتورة

# billCannotBeCheckedDueToExpiredBill
source: Bill cannot be checked because it is expired.
ar: لا يمكن اختيار هذه الفاتورة بسبب انتهاء صلاحيتها

# billCannotBeCheckedDueToClosedBill
source: Bill cannot be checked because it is closed.
ar: لا يمكن اختيار هذه الفاتورة بسبب انتهاء صلاحيتها

# openDateIssuedMessage
source: Payment cannot be completed because the bill date is not reached Yet
ar: تم رفض دفع الفاتوره بسبب عدم استحقاقها

# closeDateIssueMessage
source: Payment cannot be completed because the bill is closed.
ar: تم رفض دفع الفاتوره بسبب انتهاء صلاحية الفاتورة

# submittedFor
source: We are processing your request and we will notify you once ready
ar: جاري معاجة طلبك لدفع فواتيرك, منخبرك بمجرد ما تمت عملية الدفع بنجاح

source: There are no due bills to be paid at the moment
ar: لا توجد فواتير مستحقة للدفع في الوقت الحالي

source: There are no due bills, but you can make partial payments
ar: لا توجد فواتير مستحقة للدفع في الوقت الحالي، بإمكانات الدفع مقدماً

source: There are no due bills
ar: لا توجد فواتير مستحقة للدفع في الوقت الحالي

source: Swipe any biller to the left to remove
ar: اسحب اي فاتورة لليسار لتقوم بحذفها

source: Pay your bills with Blink!
ar: أدفع فواتيرك مع بلينك!

# youCanPayAllYourBillsNow
source: You can now pay all your bills with Blink. Few swipes away and you are done. Pay your first one today!
ar: يمكنك الآن دفع جميع فواتيرك من خلال بلينك، بخطوات بسيطة " ادفع أول دفعة اليوم!

# dailyLimitExceededorTryLater
source: There was an issue with your payment. You may have exceeded the transfer daily limit. Please try again later, or contact Blink engagement team if you need any help
ar: .في مشكلة بدفعتك، يمكن تكون تجاوزت حد التحويل اليومي. حاول كمان مرة. إذا بدك مساعدة تواصل معنا

source: Processing
ar: المعالجة

source: Invalid Billing Number
ar: رقم الفاتورة غير صحيح

source: Bill Not Found
ar: رقم الفاتورة غير موجود

source: Invalid Paid Amount
ar: المبلغ الذي تم دفعه غير صحيح

source: Billing Number Reached Its Max Amt
ar: لقد وصلت للحد الأعلى ل للدفع على رقم الفاتورة

source: Billing Number Reached Its Max Trx
ar: لقد وصلت للحد الأعلى للدفع على رقم الفاتورة

# hasbeenSuspended
source: {String} has been suspended
ar: {String} تم إيقاف خدمة كليك على الاسم المستعار

# hasBeenActivated
source: {String} has been activated
ar: {String} تم تفعيل خدمة كليك على الاسم المستعار

# hasBeenDeleted
source: {String} has been deleted
ar: {String} تم حذف خدمة كليك على الاسم المستعار

# cliqAliasUpdate
source: CliQ ID Alias has been updated
ar: تم تحديث الاسم المستعار لخدمة كليك

# cliqAliasMobileNoUpdate
source: CliQ ID Mobile Number has been updated
ar: تم تحديث رقم الموبايل المربوط بخدمة كليك

# accountDormantDesc
source: You cannot apply for a credit card when your account is inactive. Please call us on 06-5200100 to activate your account.
ar: ما بتقدر تطلب بطاقة ائتمانية لأنه حسابك غير فعال، اتصل بنا على 5200100-06 ليتم تفعيل الحساب

# dailyNarrationLimitexceed
source: Daily Narration AmountExceed
ar: تجاوز مبلغ السرد اليومي

source: Please enter amount
ar: يرجى إدخال المبلغ

source: Select at least one bill
ar: حدد فاتورة واحدة على الأقل

# nickNameValueExceeds
source: Nickname cannot be more than 50 characters long.
ar: الحد الاعلى للأسم المستعار هو ٥٠ خانة

# aliasShouldBeThreeChar
source: Alias must be between 3 to 10 alphanumeric characters
ar: يجب أن يتكون الاسم المستعار من 3 إلى 10 أحرف أبجدية رقمية

source: Alias already exist
ar: الاسم المستعار مسجل مسبقاً

source: sent
ar: ارسل

source: to you
ar: اليك

source: Return Payment
ar: أرجاع دفعة

source: Select the reason to return
ar: أختر سبب ارجاع الدفعة

source: Credit Confirmation
ar: إشعار حوالة

source: Reason to reject
ar: سبب الرفض

source: Please Select Reason To Reject
ar: يرجى اختيار سبب الرفض

source: Set as CliQ default account?
ar: تحديد كحساب أساسي

# selectReasonToReject
source: Select the reason to reject
ar: اختيار سبب الرفض

source: Error while generating QR code
ar: خطأ اثناء انشاء رمز الاجابة السريعة

source: Error while sending QR payment
ar: خطأ اثناء ارسال دفعة الاستجابة السريعة

source: Cliq Customer Already Registered
ar: الاسم المستعار مسجل مسبقا

source: Nickname length should not be greater than 50
ar: الحد الأعلى للاسم المستعار هو 50 خانة

source: QR Expired
ar: رمز الاستجابة السريعة منتهي الصلاحية

# qrInvalid
source: QR does not exist
ar: رمز الاستجابة السريعة غير موجود

source: Share
ar: شارك

# qrNotScanned
source: QR Not Scanned or Re Read the qr code/link
ar: لم يتم مسح رمز الاستجابة السريعة او اعادة قراءة رمز/رابط الاستجابة السريعة

source: Reason
ar: سبب

# fromStrin
source: from {Name}
ar: من {الاسم}

source: You Requested
ar: تم طلب

source: from you
ar: منك

source: You sent
ar: تم الارسال

source: Time
ar: وقت

source: Ref ID
ar: رقم العقار

source: Request successfully rejected.
ar: تم الطلب بنجاح/تم رفض الطلب

# exceptionExecutingGetRejectionReasons
source: Exception while executing Get Rejection Reasons
ar: خطأ أثناء تنفيذ الحصول على أسباب الرفض

# exceptionExecutingGetPaymentReasons
source: Exception while executing Get Return Payment Reasons
ar: خطأ اثناء تنفيذ الحصول على اسباب اعادة الحوالة

source: Error while getting Transaction History List
ar: خطأ اثناء الحصول على سجل الحركات السابقة

source: Error while getting Return RTP Request
ar: خطأ اثناء الحصول على طلب الدفع

source: Exception while executing Get Transaction History
ar: خطأ اثناء تنفيذ الحصول على الحركات السابقة

source: Exception while executing Approve RTP Request Otp
ar: خطأ أثناء تنفيذ الموافقة على الطلب

source: Exception while executing Approve RTP Request
ar: خطأ اثناء تنفيذ الموافقة على طلب الدفع

source: Exception while executing Reject RTP Request
ar: استثناء أثناء تنفيذ رفض طلب RTP

source: Exception while executing Return RTP Request Otp
ar: خطأ اثناء تنفيذ رفض طلب رمز المرور لمرة واحدة لطلب الدفع

source: Exception while executing Return RTP Request
ar: استثناء أثناء تنفيذ طلب إرجاع RTP

source: Exception while executing Reject RTP Request Otp
ar: استثناء أثناء تنفيذ رفض طلب RTP Otp

# nickNameAlreadyExists
source: Nickname is already stored as beneficiary
ar: الاسم المستعار مسجل مسبقا كمستفيد

source: Reason to return
ar: سبب العودة

source: Please select reason to Return
ar: الرجاء تحديد سبب للعودة

source: Error while getting Get Credit Confirmation
ar: خطأ اثناء اصدار إشعار حوالة

# exceptionWhileGettingGetCreditConfirmation
source: Exception while executing Get Credit Confirmation
ar: خطأ اثناء تنفيذ طلب إشعار حوالة

# msgIdNotFoundInTransactionHistory
source: MsgId not found in the Transaction History List
ar: خطأ اثناء الحصول على سجل الحركات السابقة

# accountClosed
source: Oops, Your account is closed, please contact us if you need any information on 06-5200100
ar: عفواً! تم إغلاق حسابك ، يرجى الاتصال بنا إذا كنت بحاجة إلى أي معلومات على 06-5200100

# last30Day
source: Last 30 days
ar: آخر 30 يوم

# cliqReturnPaymentOffline
source: Oops, the return payment service is currently unavailable. We apologize for any inconvenience caused. Please try again later or call us at 06-5200100.
ar: عفوًا، إرسال الحوالات عبر خدمة Cliq غير متاح حاليًا. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بنا على 06-5200100

# cliqSendPaymentOffline
source: Oops, sending payments over Cliq is currently unavailable. We apologize for any inconvenience caused. Please try again later or call us at 06-5200100.
ar: عفوًا، إرسال الحوالات عبر خدمة Cliq غير متاح حاليًا. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بنا على 06-5200100

# requestMoneyFeatureDisabled
source: Oops, the request to pay service is currently unavailable. We apologize for any inconvenience caused. Please try again later or call us at 06-5200100.
ar: عفوًا، إرسال الحوالات عبر خدمة Cliq غير متاح حاليًا. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بنا على 06-5200100

source: You cannot request money from your own account
ar: عفوا! ما بتقدر تطلب حوالة من نفس حسابك

# contactLessLimitmaxLimit
source: The maximum contactless limit is 300 JOD daily
ar: الحد الأعلى للحركات الغير تلامسية هو ٣٠٠ دينار يوميا

source: Login with Email
ar: الدخول باستخدام البريد الإلكتروني

source: Open Your Account Now
ar: افتح حساب جديد

source: Go back
ar: الرجوع

source: Biometric login is disabled
ar: البصمة غير فعالة

# biometricLoginIsDisabledDesc
source: Please login with your email address and enable the biometric login from Profile Settings.
ar: قم بالدخول إلى حسابك باستخدام بريدك الإلكتروني وفعل البصمة من خلال شاشة "الإعدادات الشخصية"

source: Login
ar: الدخول

# fatcaEligible
source: Unfortunately, since you are FATCA eligible, we are unable to open your account at this time.
ar: منعتذر عن إمكانية استكمال عملية فتح الحساب كونك خاضع لمتطلبات FATCA.

# accountDormantError
source: Oops! Your account is inactive. Call us on 06-5200100 to activate your account.
ar: عفوا! حسابك غير فعال. اتصل بنا على ٠٦٥٢٠٠١٠٠ ليتم تفعيل الحساب

source: Back to Contact
ar: الرجوع

source: Add Contact
ar: أضف صديق

source: Remove contact
ar: حذف صديق

# areYouSureToremoveContact
source: Are you sure you want to remove this contact?
ar: هل أنت متأكد من طلب الحذف؟

# sendAndRequestFavouriteContacts
source: Send and request with ease up to 9 favourite contacts. Would you like to add this contact to your favourite?
ar: أرسل وطلب ما يصل إلى 9 جهات اتصال مفضلة بسهولة. هل ترغب في إضافة جهة الاتصال هذه إلى المفضلة لديك؟

source: Please enter contact name
ar: الرجاء إدخال اسم جهة الاتصال

# pleaseEnterAValidaccountMobileNoAlias
source: Please enter a valid IBAN / ACCOUNT NO. / Mobile No. / ALIAS
ar: الرجاء إدخال الأيبان / رقم الحساب / رقم الجوال / الاسم المستعار

# newContacthasBeenAdded
source: New contact has been added to the list
ar: تم إضافة صديق بنجاح

source: Your contact has been removed
ar: تم حذف الصديق بنجاح

# yourContactisFavourite
source: Your contact has been added to favourite
ar: تمت إضافة جهة الاتصال الخاصة بك إلى المفضلة

source: Your contact details have been saved
ar: تم حفظ تفاصيل الاتصال الخاصة بك

source: Transiction History
ar: الحوالات السابقة

source: Please enter your contact details
ar: أضف معلومات صديقك

# thisAliasAlreadyExists
source: This alias already exists, please use another one.
ar: هذا الاسم مستخدم، اختار اسم مستعار آخر

source: Oops! CliQ ID entered is invalid
ar: عفوا! الاسم المستعار المدخل غير مسجل

source: You cannot use your CliQ ID to send money.
ar: لا يمكن استخدام اسم المستعار (كليك) الخاص بك لإرسال حوالة

source: You cannot use your CliQ ID to request money.
ar: لا يمكن استخدام اسم المستعار (كليك) الخاص بك لطلب حوالة

# cliqIDisSuspended
source: Oops! CliQ ID entered is invalid
ar: عفوا! الاسم المستعار المدخل غير مسجل

# cliqIdAlreadyExists
source: This CliQ ID already exists, please use another one.
ar: الاسم المستعار أو الرقم في كليك مسجل، استخدم رقم أو اسم مستعار آخر

source: Book Your Flight
ar: احجز تذكرة طيران

source: Contact information
ar: معلومات الاتصال

# contactInformationDetails
source: Just give us any of these information that you know about your contact. We’ll sort out the rest for you.
ar: ما عليك سوى تزويدنا بأي من هذه المعلومات التي تعرفها عن جهة الاتصال الخاصة بك. سنقوم بفرز الباقي لك.

source: Favourites
ar: الأصدقاء المفضلين

source: Others
ar: باقي الأصدقاء

source: You paid
ar: لقد دفعت

# dormantAccountCCFailedTitle
source: Unfortunately, your credit card application has failed!
ar: لم تتم عملية طلبك للبطاقة الائتمانية بنجاح

source: returned
ar: ارجع

# nickNameUpdated
source: Contact nickname has been updated
ar: لقد تم تعديل الاسم المستعار بنجاج

# creditContactlessLimitExceeded
source: Contactless payment limit exceeded.
ar: تم تجاوز حد الدفع اللاتلامسي.

# favouriteContactLimitExceeded
source: Oops! You can only select up to 9 favourite contacts
ar: عفوا! ما بتقدر تختار أكثر من ٩ أصدقاء مفضلين

# nicknameAlreadyExistsM
source: Oops! Nickname already exists, use another one
ar: عفوا! اسم المستعار مسجل، ادخل اسم مستعار آخر

# identifierAlreadyExists
source: Oops! IBAN/account number/ mobile number/Alias already exists, use another one.
ar: عفوا! رقم الحساب/ رقم الموبايل/ اسم المستعار (كليك) مسجل، ادخل تعريف آخر

# updateNicknameFailure
source: Oops! Nickname cannot be updated, please try again later
ar: عفوا! لا يمكن تعديل اسم المستعار، حاول مرة ثانية لاحقا

# removeNicknameFailure
source: Oops! Nickname cannot be deleted, please try again later
ar: عفوا! لا يمكن حذف اسم المستعار، حاول مرة ثانية لاحقا

# imageFormatWrong
source: Oops! Please use .PNG or .JPG format.
ar: عفوأ! حمل صوره تكون GPJ أو PNG

# avatarUpdateFailure
source: Oops! Image cannot be uploaded, please try again later
ar: عفوا! لا يمكن تحميل الصورة، حاول مرة ثانية لاحقا

# removeAvatarFailure
source: Oops! Image cannot be removed, please try again later
ar: عفوا! لا يمكن حذف الصورة، حاول مرة ثانية لاحقا

# ContactMarkFavouriteFailure
source: Oops! Contact not marked as favorite, please try again later
ar: عفوا! لم يتم إضافة الصديق إلى قائمة المفضلين، حاول مرة ثانية لاحقا

source: Last 30 days
ar: آخر 30 يوم

source: Last 60 days
ar: آخر 60 يوم

source: Last 90 days
ar: آخر 90 يوم

source: View Transactions
ar: الحوالات السابقة

# pleaseFillMissingField
source: Oops! Please fill the missing field.
ar: عفوا! يرجى إدخال المعلومة الناقصة

source: Accepted
ar: نفذت

source: Rejected
ar: مرفوضة

source: Pending
ar: قيد التنفيذ

# sendMoneyFormateSample
source: Please provide any account details you have for your contact,and we will take care of the rest. If the contact’s account is in Blink, we will send the money to Blink account, otherwise, we will send it via CliQ to his/her bank account. Please be mindful of the formatting examples as follows:
ar: زوّدنا بأي معلومة عندك عن حساب متلقي الحوالة والباقي علينا. إذا كان حساب متلقي الحوالة في بلينك رح نحوّل المبلغ على حسابه في بلينك، وغير هيك رح يتم التحويل من خلال كليك(CliQ)لحسابه البنكي. تأكد من إدخال المعلومة بالشكل الصحيح حسب الأمثلة التالية:

source: IBAN (CliQ)
ar: IBAN(تحويل من خلال كليك)

# accountBlink
source: Account No. (Blink)
ar: رقم الحساب (بلينك)

source: Mobile No. (CliQ or Blink)
ar: رقم الموبايل (بلينك أو كليك)

source: Alias (CliQ)
ar: الاسم المستعار (كليك)

# ibanAccountNumberMobileNumberAlisInvalid
source: Oops! IBAN/account number/ mobile number/Alias is invalid, use another one.
ar: عفوا! رقم الحساب/ رقم الموبايل/ اسم المستعار (كليك) غير معرف، ادخل تعريف آخر

# enterValidIBANCLiQ
source: Oops! please enter an IBAN or CliQ ID to request money.
ar: عفوا! ادخل رقم حساب IBAN أو اسم مستعار/رقم الموبايل في كليك لطلب حوالة

# transferCannotbeDone
source: Oops! Sending money failed, contact details need to be updated
ar: عفوا! لا يمكن التحويل، لازم اتعدل تفاصيل صديقك المستفيد

# requestMoneyFormateSample
source: Please provide any account details you have for your contact, and we will take care of the rest. The request will be processed via CliQ. Please be mindful of the formatting examples as follows:
ar: زوّدنابأي معلومة عندك عن حساب متلقي الطلب والباقي علينا. رح يتم الطلب من خلال كليك(CliQ). تأكد من إدخال المعلومة بالشكل الصحيح حسب الأمثلة التالية:

# manageContactSendRequestSample
source: Please provide any account details you have for your contact. Sending and requesting money is done either within Blink or via CliQ. Please be mindful of the formatting examples as follows:
ar: زّودنا بأي معلومة عندك عن الحساب والباقي علينا. تحويل وطلب الأموال رح يتم داخل بلينك أو من خلال كليك (CliQ). تأكد من إدخال المعلومة بالشكل الصحيح حسب الأمثلة التالية:

# accountMobileNoCliQ
source: IBAN/ Alias/ Mobile No. (CliQ)
ar: الأيبان/ الاسم المستعار/ رقم الموبايل (كليك)

# oopsYouCantSendMoneyToYourOwnAccount
source: Oops! you cannot send money to your own account
ar: عفوا! ما بتقدر تحول لنفس حسابك

# oopsTheQRisInvalid
source: Oops! The QR code is invalid. Please try again.
ar: عفوا! رمز الاستجابة السريع QR غير صالح للاستخدام. حاول مرة أخرى

source: Oops! You can only create 5 CliQ IDs
ar: عفوا!ممكن تسجل 5 أسماء مستعارة/أرقام هواتف فقط على كليك

source: Mobile No. (CliQ)
ar: رقم الموبايل (كليك)

source: Money received from
ar: أموال محولة من

source: Money sent to
ar: أموال مرسلة إلى

source: HOME
ar: الشاشة الرئيسية

source: MORE
ar: المزيد

source: CONTACT US
ar: اتصل بنا

# oopsErrorWhileUpdatingCardLimit
source: Oops! Something went wrong while updating limit, please try again later.
ar: عفوا! حصل خطأ خلال تعديل السقف، حاول مرة ثانية لاحقا

source: Oops! You have exceeded your daily transfer limit.
ar: عفوا! لقد تجاوزت الحد اليومي للحوالات

source: Oops! The QR code is expired.
ar: عفوا! انتهت صلاحية رمز الاستجابة السريع QR

# accountDormantTitle
source: Your account is inactive!
ar: حسابك غير فعال

# accountDormantStatusDesc
source: Your have not used your account for a long time and it is now deactivated. Please call us on 06-5200100 to activate your account and enjoy countless benefits.
ar: حسابك غير فعال لأنك ما استخدمته لفترة طويلة. اتصل بنا على 5200100-06 لحتى نفعلك حسابك وتقدر تستمتع بالمزايا والخدمات الي عم منقدمها.

# dormantAccountPhysicalCardReq
source: Oops! You cannot request your physical card as your account is inactive. Call us on 06-5200100 to activate your account.
ar: عفوا! لا يمكنك طلب طباعة البطاقة لأنه حسابك غير فعال. اتصل بنا على 5200100-06 ليتم تفعيل الحساب

# yourAccountInactive
source: Your account is inactive
ar: حسابك غير فعال

# callToActivate
source: Call us on 06-5200100 to activate your account and get your debit card.
ar: اتصل بنا على 5200100-06 لحتى نفعلك حسابك وتقدر تطلب بطاقة الدفع المباشر .

# notEnoughAmountToPurchase
source: You have insufficient balance in your account
ar: عفوا! لم تتم العملية بنجاح لأنه الرصيد المتوفر غير كاف

source: Valid Until
ar: صالح حتى

source: Current Account
ar: الحساب الحالي

source: Filter Vouchers
ar: اختيار القسائم الإلكترونية

source: Min. Price
ar: القيمة الأدنى

source: Max. Price
ar: القيمة الأعلى

source: Category
ar: الفئة

source: Preferred Region
ar: المنطقة

source: Copied
ar: نسخ

# recipientNameValidation
source: Oops! Recipient name should be at least 2 parts and each part to be with a minimum of 3 characters.
ar: عفوا! يجب أن يكون اسم المستلم من مقطعين وكل مقطع من 3 خانات على الأقل

source: Select Value
ar: اختار القيمة

source: Back
ar: الرجوع

source: Select region first
ar: حدد المنطقة أولاً

source: E-Vouchers
ar: القسائم الإلكترونية

source: Buy Vouchers
ar: شراء القسائم الإلكترونية

source: History
ar: الحركات السابقة

# eVoucherSearchLabel
source: What are you looking for?
ar: ابحث هنا

# browserByCatgy
source: Browse by Category
ar: تصفح حسب الفئة

source: Reset Filter
ar: إلغاء الفلتر

source: All Region
ar: جميع المناطق

source: All Categories
ar: جميع الفئات

# selectPreferredRegionAmount
source: Select your preferred region and amount
ar: اختار المنطقة والقيمة التي تناسب طلبك

source: REGION
ar: المنطقة

source: VALUE
ar: القيمة

source: View Voucher
ar: عرض القسيمة الإلكترونية

# howWouldLikeToPay
source: How would you like to make the payment
ar: كيف تريد ان تقوم بالدفع

source: Purchase Now
ar: شراء الآن

source: to View Voucher
ar: لعرض القسيمة

# viewVoucherDialogDescription
source: Your voucher is being processed. You’ll get notification when your voucher is ready to be used.
ar: القسيمة الإلكترونية قيد الإنتظار، رح نخبرك لما تكون جاهزة للاستخدام.

source: e-Vouchers are here!
ar: القسائم الإلكترونية صارت متاحة!

# eVoucherLandingDialogDescption
source: You can now purchase and redeem e-vouchers from your favorite online & offline stores, locally and internationally.
ar: صار بإمكانك تشتري القسائم الإلكترونية من مختلف المتاجر المحلية والدولية المفضلة لديك.

source: Select any Option
ar: حدد خيار تصفية واحدًا على الأقل
