Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

# primaryCreditCardHoldIdNotMatchGroom
source: Invalid relationship. Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-307)
ar: علاقة غير صحيحة. يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والديك. (Err-307)

# supplementaryCreditCardHolderIdNotMatchMotherFather
source: Invalid relationship. Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-308)
ar: علاقة غير صحيحة. يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والديك. (Err-308)

# primaryDebitCreditCardHolderNotMatchMotherFather
source: Invalid relationship. Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-309)
ar: علاقة غير صحيحة. يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والديك. (Err-309)

source: No Activity to Display
ar: لا يوجد نشاط لعرضه

source: No Payment activity to display
ar: لا يوجد نشاط دفع لعرضه

source: Swipe to view more
ar: اسحب لعرض المزيد

# fromS
source: from
ar: من

source: No Transaction to display
ar: لا توجد معاملة لعرضها

# helloE
source: Hello!
ar: مرحبا!

# amountGreaterThan0
source: Amount to pay should be greater than 0
ar: يجب أن يكون المبلغ المطلوب دفعه أكبر من 0

# cannotProceedNoAhwalDataFound
source: Sorry, onboarding is currently only available to Jordanian nationals.
ar: لا يمكن متابعة إعداد المستخدم نظرًا لعدم وجود بيانات مقابل رقم الهوية الوطنية

source: Resend Code
ar: أعد إرسال الرمز

source: Statement
ar: بيان

source: Account No. Copied
ar: تم نسخ رقم الحساب

source: IBAN Copied
ar: نسخ الأيبان

source: Card Number Copied
ar: تم نسخ رقم البطاقة

# idAlreadyExists
source: IdNo Already Exist
ar: رقم الهوية موجود بالفعل

# creditZeroBalanceRejtitle
source: Unfortunately, we are unable to start your credit card application.
ar: عذرا، لا يمكننك التقدم لطلب البطاقة الائتمانية.

# creditZeroBalanceRejDesc
source: Please fund your account in order to apply for a credit card.
ar: يرجى تمويل حسابك من أجل التقدم بطلب للحصول على بطاقة ائتمان

# callDisconnected
source: Your call was disconnected. Please try again.
ar: لقد تم انقطاع الاتصال، يرجى المحاولة مرة اخرى

source: Deposit via eFawateercom
ar: إيداع من خلال خدمة إي فواتيركم

# depositViaeFawateercomDesc
source: Deposit money directly from any of eFawateercom agents or through your bank application using your account number.
ar: إيداع فوري بحسابك من خلال اي وكيل لخدمة إي فواتيركم او من خلال تطبيق البنك الخاص بك بإستخدام رقم حسابك

# cardRequiresActivation
source: Your card is out for delivery
ar: بطاقتك في الطريق.

# cardRequiresActivationDesc
source: Once your card is delivered, you will be able to activate it and enjoy its benefits.
ar: بمجرد استلام بطاقتك، ستتمكن من تفعيلها والاستمتاع بمزاياها.

source: Card settings disabled
ar: إعدادات البطاقة معطلة.

# cardSettingsDisabledDesc
source: Your card is on the way. Once it is delivered, you will be able to manage your card settings.
ar: بطاقتك في الطريق. بمجرد استلامها، ستتمكن من إدارة إعدادات بطاقتك.

# flipBackDesc
source: Once your card is delivered, you will be able to retrieve your card information and use it online.
ar: بمجرد استلام بطاقتك، ستتمكن من الاطلاع على معلوماتها واستخدامها عبر الإنترنت.

source: Credit card on delivery
ar: بطاقة الائتمان البطاقة في الطريق

# agentNotAvailablePopUpDesc
source: Apologies, we have no agents available at the moment to verify you, please try later. Our Credit Card verification is accessible, 7 days a week between 10:00 AM - 6:00 PM
ar: نأسف ، فريقنا غير متاح حالياً، يرجى المحاولة لاحقًا. فريق التواصل المتخصص بطلبات البطاقات الائتمانية متاح 7 أيام في الأسبوع بين الساعة 10:00 صباحًا - 6:00 مساءً

# ahwalServiceNotAvailable
source: Service is down please try again later
ar: الخدمة معطلة ، جرّب كمان مرة بعدين

source: ADDRESS
ar: العنوان

# locationRestricted
source: Your location is restricted from using this app.
ar: تطبيق بلنك غير متاح في منطقتك الجغرافية.

# callDroppedDesc
source: There was a problem on your last verification call. Initiate your call again anytime between 10:00 am and 6:00 pm to complete your application.
ar: عفوا! صار خطأ في الاتصال، حاول كمان مرة بأي وقت بين الساعة ١٠:٠٠ص و ٦:٠٠م لتستكمل الطلب

# applicationNotAvailableInRegion
source: The Blink mobile application is not available in your region!
ar: تطبيق بلنك غير متاح في منطقتك الجغرافية

source: Attention
ar: تنويه

source: No Data Found
ar: لاتوجد بيانات

source: Something went wrong
ar: هناك خطأ ما

source: Search Again
ar: البحث مرة أخرى

source: Request physical card
ar: طلب تسليم البطاقة

# requestPhysicalCardDec
source: Are you sure you want your physical Yellow Sun debit card to be delivered to your address?
ar: بدك نوصلك بطاقة الدفع المباشر لعنوانك المسجل عنا؟

# requestPhysicalCardSuccessDec
source: Your card is being printed. Aramex will contact you soon to deliver your physical card. In the meantime, you can continue using your virtual card online. Once you receive your card you can use it to pay and shop anywhere! Upon delivery your card contactless limit will be 300 JOD.
ar: البطاقة قيد الطباعة. سيتم التواصل معك من قبل شركة أرامكس قريبًا لتسليم بطاقتك. بامكانك الاستمرار في استخدام بطاقتك الافتراضية عبر الإنترنت. بمجرد استلام بطاقتك يمكنك استخدامها للدفع والتسوق في أي مكان! سيكون حد البطاقة اللاتلامسية 300 دينار عند استلامها.

# errorPhysicalDCXCS
source: Error while applying for physical card request
ar: واجهتنا مشكلة خلال طلب البطاقة، يرجى المحاولة مرة اخرى

# errorPinTranslationXCS
source: PIN change error
ar: خطأ عند تغيير الرمز السري

# errrorForPinChangeNI
source: Error while requesting for pin change
ar: واجهتنا مشكلة عند تغيير الرمز السري للبطاقة. يرجى المحاولة مرة اخرى

# errorCCUnBlockNI
source: Error while unblocking pin
ar: واجهتنا مشكلة عند اعادة تفعيل الرمز السري للبطاقة. يرجى المحاولة مرة اخرى

# loginRegisterDisabled
source: We're currently offline and will be back shortly!
ar: الخدمة غير متاحة حالياً، يرجى المحاولة لاحقاً

source: Blink with Apple Pay
ar: ادفع مع بطاقات بلينك وخدمة أبل باي

source: ADD TO APPLE PAY
ar: أضافة بطاقة بلينك لأبل باي

# yourNowSetWithApplePay
source: Your card is now set up with Apple Pay.
ar: تم تفعيل بطاقتك على خدمة أبل باي

# applePaySetFailed
source: Apple Pay set up failed
ar: نأسف لم يتم تفعيل البطاقة بنجاح، يرجى المحاولة مرة أخرى.

# yourAddOtherCardFromCardSettings
source: You can add your other cards from Card Settings.
ar: بامكانك أضافة بطاقات بلينك الأخرى التابعة لك من خلال خدمة اعدادات البطاقة

# errorSettingApplePay
source: An error occurred while setting up Apple Pay. Please try again later.
ar: نأسف لم يتم تفعيل البطاقة بنجاح، يرجى المحاولة مرة أخرى.

# rebelliousRedCreditCard
source: Rebellious Red Visa Credit Card
ar: البطاقة الائتمانية الحمراء البطاقةالائتمانية

source: Credit Card
ar: البطاقةالائتمانية

source: Add other card to Apple Wallet?
ar: أضف بطاقة اخرى لأبل باي؟

# addOtherCardToAppleWalletDialogDescription
source: Would you like to add your other card to your Apple Wallet, now? You can always do it from your Card Settings, at any time you like.
ar: هل ترغب باضافة بطاقاتك الأخرى لمحفظة أبل التابعة لك؟ بامكانك في أي وقت إضافة أي من بطاقاتك من خلال خدمة اعدادات البطاقة.

# yellowSunDebitCard
source: Yellow Sun Visa Debit Card
ar: بطاقة الدفع المباشر الصفراء بطاقة الدفع المباشر

source: Apple Pay set up failed
ar: نأسف لم يتم تفعيل البطاقة بنجاح، يرجى المحاولة مرة أخرى.

# errorSettingUpApplePay
source: An error occurred while setting up Apple Pay. Please try again later.
ar: نأسف لم يتم تفعيل البطاقة بنجاح، يرجى المحاولة مرة أخرى.

# selectOneCardToAddApplePay
source: Select one card that you want to add to Apple Pay
ar: أختار احدى البطاقات لاضافتها على أبل باي

# blinkWithApplePayLandingDialogDescription
source: You can now Blink with style using Apple Pay! Simply add your credit or debit cards to your Apple Wallet in only few secure steps.
ar: دايما في اكثر مع بلينك! تألق بالدفع باستعمال أبل باي! ما عليك سوى إضافة بطاقة الائتمان أو الدفع المباشر الخاصة بك إلى محفظة أبل التابعة لك في بضع خطوات آمنة فقط.

# debitCards
source: Debit Card
ar: بطاقة الدفع المباشر

source: No cards to display
ar: لا يوجد بطاقات للعرض

source: Added to
ar: اضيفت الى

# yourCardAddedToApplePay
source: Your card has been added to Apple Wallet.
ar: تمت إضافة بطاقتك إلى Apple Wallet

# yourCardAddedToApplePayDesc1
source: Apple Pay is an easier way to pay in shops, in apps, and online with your iPhone, Apple Watch, iPad and Mac.
ar: Apple Pay هي طريقة أسهل للدفع في المتاجر والتطبيقات وعبر الإنترنت باستخدام iPhone و Apple Watch و iPad و Mac

# yourCardAddedToApplePayDesc2
source: Use Apple Pay wherever you see these symbols.
ar: استخدم Apple Pay أينما ترى هذه الرموز

source: ID Verification Failed
ar: فشل التحقق من الهوية

# payBills
source: Paying {noOfBills} bills
ar: تسديد {noOfBills} فاتورة

# tapToEditAmt
source: Tap to edit
ar: اضغط للتعديل

# saveBills
source: Saved Bills
ar: فاتورة جديدة

source: Pay
ar: دفع

source: Pay All Bills
ar: تسديد كل الفواتير

source: View and pay your due bills
ar: عرض ودفع الفواتير المستحقة

source: to Payments
ar: الى الفواتير

source: Water and Electricity
ar: المياه و الكهرباء

source: Telecommunication
ar: الاتصالات

source: Government Service
ar: خدمات حكومية

source: Banks
ar: البنوك

source: Financial Services
ar: خدمات مالية

source: Fuel and Gas
ar: الوقود و الغاز

source: Travel and Transportation
ar: السفر و التنقل

source: New Bill
ar: فاتورة جديدة

source: Bill Name
ar: اسم الفاتورة

source: Biller name
ar: اسم المفوتر

# billsAndPayments
source: Bills & Payments
ar: الفواتير و الدفع

source: Services
ar: الخدمات

source: Reference No.
ar: الرقم المرجعي

# tapAmtToEdit
source: Tap amount to edit
ar: اضغط على المبلغ للتعديل

# dueAmt
source: Due Amount
ar: المبلغ المستحق

source: Fees
ar: العمولات

source: Due
ar: مستحقة

source: My Bills
ar: الفواتير

source: PAY BILL
ar: تسديد الفاتورة

source: Bill details
ar: تفاصيل الفاتورة

source: Enter bill details
ar: ادخل تفاصيل الفاتورة

source: Are you sure?
ar: هل انت متأكد؟

source: Back to Manage CliQ
ar: العودة الى ادارة حساب كليك

source: Linked Account
ar: الحسابات المربوطة

source: Change default account
ar: تغير الحساب الأساسي

source: My Postpaid Bill
ar: فواتيري آجلة الدفع

source: View my bills
ar: عرض الفواتير

source: Manage my bills
ar: إدارة الفواتير

source: My Prepaid Bills
ar: فواتيري الدفع المسبقة

source: Paying
ar: تسديد الى

# howWouldLikeToPayPrePaidYourBills
source: How would you like to pay your prepaid bills?
ar: كيف ترغب ان تقوم بتسديد فواتيرك المدفوعة مسبقا

# howWouldLikeToPayPostPaidYourBills
source: How would you like to pay your postpaid bills?
ar: كيف ترغب ان تقوم بتسديد فواتيرك

# confirmYourPaymentAmtBelow
source: Confirm your payment amount below
ar: يرجى تأكيد مبلغ الدفع

# addThisBillToSaveList
source: Add this bill to your saved list
ar: اضافة الفاتورة للفواتير المخزنة

source: Do you really want to delete
ar: هل تريد حذف الفاتورة

source: from Saved Bills?
ar: من فواتيرك المخزنة

source: Pay via QR
ar: تحويل أموال من خلال رمز الاستجابة السريع QR

# payAndRequestMoneyViaQR
source: Pay and request money via QR code is only available within Blink at the moment. We will let you know if it is ready and available for everyone.
ar: الدفع و طلب الأموال من خلال رمز الاستجابة السريع متاح حاليا فقط للتحويل بين عملاء بلينك ، سنعلمك في حال أصبحت جاهزة و فعالة للجميع

# payViaQRDesc
source: Place the QR code within the frame and proceed with payment
ar: ضع رمز الاستجابة السريعة داخل الإطار وأكد عملية الدفع

source: to
ar: إلى

# bookFligtWithUs
source: Book flight with us!
ar: احجز تذكرة طيراتك معنا!

source: Book Now
ar: احجز الان

# rjFrom
source: FROM
ar: من

source: DEPART ON
ar: المغادرة

source: RETURN ON
ar: عودة

source: Passengers
ar: المسافرون

source: Cabin Class
ar: الدرجة

source: Purchase for
ar: تفاصيل الدفع

source: Purchase Date
ar: تاريخ الشراء

# departOnForPurchasePage
source: Depart On
ar: تغادر

source: to Booking Summary
ar: إلى تفاصيل الحجز

source: Total Amount
ar: مجموع المبلغ

source: Tax Amount
ar: قيمة الضريبة

source: Depart
ar: المغادرة

# returnTitle
source: Return
ar: العودة

source: Booking Ref No.
ar: الرقم المرجعي

source: BOOK FLIGHT
ar: احجز تذكرة طيران

source: Cancel Booking
ar: الغاء الحجز

# cancelBookingDetail
source: Are you sure you want to cancel your booking? You’ll have to start over again if you cancel.
ar: هل انت متأكد من الغاء الحجز ؟ اذا قمت بألغاء الحجز ستضطر الى إعادة العملية من البداية

# pleaseConfirmFlightDetail
source: Please confirm your flight details
ar: أكّد على تفاصيل الحجز

# howYouLikeToPayment
source: How would you like to make the payment
ar: استكمل عملية الدفع

# rjFlightBookingToDialogBoxDescription
source: Enter the name of the country. Your destination will appear on the list.
ar: ادخل اسم البلد وسيتم إظهارها على القائمة

# bookFligtWithUsDescrption
source: Travelling soon? You can now book your Royal Jordanian flight within Blink! It is seamless and yet secure.
ar: مسافر قريبا؟ احجز تذكرتك من خلالنا مع الملكية الأردنية بطريقة سهلة وآمنة.

source: Account Card
ar: بطاقة الحساب

# qrValidForOneHour
source: QR code will be valid for 30 mins
ar: رمز الاستجابة فعال لمدة 30 دقيقة

source: payment not done
ar: لم تتم عملية الدفع

source: No tickets found
ar: لم يتم العثور على تذكرة

# dateComparison
source: Depart on date should not be greater than return date
ar: يجب ألا يكون تاريخ المغادرة أكبر من تاريخ العودة

# whenAcceptingCreationOfYourCliqId
source: When accepting the creation of your CliQ ID, you should be aware that some or all of your information (including your full name, phone number linked to the service, your account or your IBAN number and the bank that maintains your account) may be shared with the third party when receiving or sending payments through CliQ.
ar: عند انشاء اسمك المستعار على كليك، تقرّ وتوافق على: أن جميع معلوماتك (المتضمنة اسمك الكامل، رقم الموبايل المربوط بهذه الخدمة، رقم حسابك أو رقم حسابك الدولي و البنك المزود للخدمة) سيتم إظهارها لمنشئ الحوالة عبر كليك. أنه يمنع انشاء أية أسماء مستعارة تعود لعلامات تجارية أو اسماء تجارية ليست مملوكة لك، أو غير مقبولة على الصعيد السياسي أو العقائدي أو التجاري أو الاجتماعي.

# areYourToChangeDefaultAccountOfYourCliqId
source: Are you sure you want to change the default account for your CliQ ID? Please provide your consent to complete the request.
ar: هل انت متأكد انك تريد تغيير حسابك الرئيسي لحساب كليك؟ يرجى تزويدنا بموافقتك للاستمرار

source: Default
ar: افتراضي

source: Error while Getting Account By Customer ID
ar: خطأ أثناء الحصول على الحساب بواسطة معرّف العميل

source: Error while Submitting Outward Payment
ar: خطأ أثناء إرسال الدفعة الصادرة

source: Error on Approve RTP Request
ar: خطأ في الموافقة على طلب RTP

source: Account is linked to the alias, but unable to set it to default
ar: الحساب مرتبط بالاسم المستعار ، ولكن يتعذر تعيينه على الافتراضي

source: Error on Request To Pay Result
ar: خطأ في طلب سداد النتيجة

source: Customer of invalid Alias
ar: عميل الاسم المستعار غير صالح

source: Invalid Iban
ar: إيبان غير صالح

source: Invalid Alias
ar: الاسم المستعار غير صالح

source: Invalid Alias Value
ar: قيمة الاسم المستعار غير صالحة

source: CliqID Updated Successfully
ar: تم تحديث CliqID بنجاح

source: Please Add Link Account
ar: الرجاء إضافة حساب الارتباط

# manageCliqIdRoute
source: Manage CliQ ID
ar: ادارة حساب Cliq

# accountSuccessfullyLinked
source: Account is successfully linked with CliQ ID
ar: تم ربط الحساب بنجاح مع حساب كليك

# areYouSureToUnlinkAccount
source: Are you sure you want to unlink the account with your CliQ ID?
ar: هل انت متأكد انك تريد الغاء ربط الحساب مع حساب كليك؟

source: Unlink account with CliQ ID
ar: الغاء ربط الحساب مع حساب كليك

source: Confirm Delete?
ar: تأكيد الحذف؟

# areYouSureWantToDelete
source: Are you sure you want to delete
ar: هل انت متأكد انك تريد حذف

source: from your CliQ ID list?
ar: من لائحة حسابات كليك؟

# suspandClidId
source: Suspend CliQ ID
ar: ايقاف حساب كليك

# areYouSureToSuspandCliqId
source: Are you sure you want to suspend your CliQ ID?
ar: هل انت متأكد من انك تريد ايقاف حساب كليك

source: Reactivate CliQ ID
ar: اعادة تفعيل حساب كليك

source: Account successfully unlinked
ar: تم الغاء ربط الحساب بنجاح

source: Activate ID
ar: تفعيل الهوية

source: requested
ar: تم الطلب بنجاح

source: you
ar: انت

source: Accept
ar: موافقة

source: Reject
ar: رفض

source: is Requesting
ar: منك، هل تريد الموافقة

# fromYouWouldYouLikeToAcceptIt
source: from you. Would you like to accept?
ar: منك، هل تريد الموافقة

source: as per his request. Confirm this action?
ar: حسب الطلب، الموافقة على الطلب

source: You are about to send
ar: انت على وشك ان ترسل

source: Accept Request
ar: موافقة على الطلب

source: Reject Request
ar: رفض الطلب

source: You are about to reject
ar: انت على وشك ان ترفض

# requestFrom
source: Request Form
ar: الطلب من

# towithspace
source: to
ar: الى

source: Error while getting alias
ar: حدث خطأ عند طلب الاسم المستعار

source: Error while getting account by alias
ar: حدث خطأ عند طلب حساب الاسم المستعار

source: Error while creating an alias
ar: حدث خطأ عند انشاء الاسم المستعار

source: Error while linking account
ar: حدث خطأ عند ربط الحساب

source: Error while editing an alias
ar: حدث خطأ عند تعديل الاسم المستعار

# errorWhileTryingTosuspandAnAlias
source: Error while trying to suspend an alias
ar: حدث خطأ عند ايقاف الاسم المستعار

source: Error while re-activating an alias
ar: حدث خطأ عند اعادة تفعيل الاسم المستعار

source: Error while deleting an alias
ar: حدث خطأ عند حذف الاسم المستعار

source: Error while changing to default account
ar: حدث خطأ عند تغيير الحساب الرئيسي

source: Error while un-linking account
ar: حدث خطأ عند فك ربط الحساب

source: Error while requesting money
ar: حدث خطأ عند طلب الاموال

source: Error while requesting money activity
ar: حطأ عند طلب انشطة

source: Error while updating RTP request
ar: حدث خطأ عند تحديث طلب الاموال

source: Error while sending money to cliq iban
ar: حدث خطأ عند ارسال الاموال للايبان

source: Error while Getting Account By Customer ID
ar: حدث خطأ عند استرجاع الحساب

# errorWhileSubmmitingOutwardPayment
source: Error while Submitting Outward Payment
ar: حدث خطأ عند تقديم طلب الدفع

source: Error on Approve RTP Request
ar: حدث خطأ عند الموافقة على طلب ارسال الاموال

# AccountIsLinkedToTheAlias
source: Account is linked to the alias, but unable to set it to default
ar: الحساب مربوط الى الاسم المستعار، لكن لم ننجح من جعله الحساب الرئيسي

source: Error on Request To Pay Result
ar: حدث خطأ عند طلب الاموال

source: Customer of invalid Alias
ar: الاسم المستعار غير صحيح

source: Invalid Iban
ar: الايبان غير صحيح

source: Invalid Alias
ar: الاسم المستعار غير صحيح

# InvalidMobileNo
source: Invalid Mobile Number
ar: رقم الموبايل غير صحيح

# serviceIsNotavaliable
source: Service is not available
ar: الخدمة غير متوفرة حاليا

# helloHereMyBlinkAccount
source: Hello! Here are my Blink account details:
ar: مرحبًا! ها هي تفاصيل CliQ الوامضة:

# getYourBlinkAccountTodayBlinkNow
source: Get your blink account today.
ar: احصل على حساب بلينك اليوم. طرفة عين الآن!

# accountUnlinkedSuccessfully
source: Account Unlinked from CliqID Successfully
ar: تم إلغاء ارتباط الحساب بـ CliqID بنجاح

source: Account Linked Successfully
ar: تم ربط الحساب بنجاح

source: Account Deleted Successfully
ar: تم حذف الحساب بنجاح

source: Account Activated Successfully
ar: تم تفعيل الحساب بنجاح

source: Account Suspended Successfully
ar: تم تعليق الحساب بنجاح

source: Link Account
ar: ربط حساب

# cliqMobileNumberUpdate
source: CLIQ ID UPDATE CliQ ID Mobile Number has been updated
ar: تعديل حساب كليك تم تحديث رقم الهاتف المحمول الخاص بمعرف CliQ

source: RECIPIENT NAME
ar: اسم المستلم

source: RECIPIENT ADDRESS
ar: عنوان المستلم

# accountMobileNoAlias
source: IBAN / ACCOUNT NO. / MOBILE NO. / ALIAS
ar: الأيبان/ رقم الحساب/ رقم الموبايل/ الاسم المستعار

# mobileNoRegisteredWithBlink
source: Mobile number registered with blink
ar: رقم الهاتف المحمول المسجل مع وميض

# mobileNoRegisteredWithBlinkDesc
source: We’ve found that the mobile number you entered is registered with blink. If you continue, the money will be sent to the recipient’s blink account. If you intend to proceed with another bank account, you can use IBAN or Alias.
ar: لقد وجدنا أن رقم الهاتف المحمول الذي أدخلته مسجل في blink. إذا تابعت ، فسيتم إرسال الأموال إلى حساب المستلم الوامض. إذا كنت تنوي المتابعة مع حساب مصرفي آخر ، فيمكنك استخدام رقم الحساب المصرفي الدولي (الأيبان) أو الاسم المستعار.

source: Number formatting
ar: تنسيق الأرقام

# dummyIBAN
source: ABC0000038363829727227184
ar: ABC000012341234123819241213

source: Mobile No.
ar: رقم الموبايل.

# samplesOfNoFormatting
source: Here are samples of the number formatting :
ar: فيما يلي نماذج من تنسيق الأرقام:

# emptyRecipientName
source: Enter Recipient Name
ar: أدخل اسم المستلم

# emptyRecipientAddress
source: Enter Recipient Address
ar: أدخل عنوان المستلم

# savingAccountList
source: Savings Account {String}
ar: حساب التوفير {String}

# defaultWord
source: Default
ar: افتراضي

# hereMyCliqDetails
source: Hello! Here’s my blink CliQ details:
ar: مرحبًا! ها هي تفاصيل CliQ الوامضة:

source: CLIQ Type
ar: نوع CLIQ

source: CLIQ ID
ar: معرف CLIQ

# defaultAccountUpdated
source: Default account has been updated
ar: قد تم تعديل الحساب الرئيسي

# aliasHint
source: Alias must be a maximum of 10 alphanumeric characters
ar: الاسم المستعار يجب ان لا يزيد عن ١٠ خانات، و يمكن ان يحتوي احرف وارقام

# aliasMobileNoHint
source: Mobile number must start with 00962
ar: رقم الموبايل يجب ان يبدأ ب ٠٠٩٦٢

source: Alias nickname hint:
ar: تلميح للاسم المستعار:

source: Alias mobile hint:
ar: تلميح لرقم الموبايل:

# noRTPActivityToDisplay
source: There are currently no requests to display
ar: Tلا يوجد حاليا أي طلبات لعرضها

# howWouldLikeToPayYourBills
source: How would you like to pay your bills?
ar: كيف ترغب ان تقوم بتسديد فواتيرك

source: Swipe up to pay new bill
ar: اسحب للاعلى لتسدد فاتورة جديدة

source: How much would you like to pay?
ar: ما المبلغ الذي تريد ان تسدده

source: No Biller Found
ar: لم نتمكن من العثور على الفاتورة

source: No Prepaid Category Found
ar: لم نتمكن من العثور على فئة الدفع المسبق

source: Denomination
ar: فئة

source: Pay My Bill
ar: تسديد فاتورتي

source: Manage and pay my bills
ar: إدارة ودفع الفواتير

source: Insufficient funds bill cannot be paid
ar: لا يوجد لديك رصيد كافي لتسديد الفاتورة

source: Your bill has been removed.
ar: نم حذف الفاتورة

source: Biller Added Successfully.
ar: تم اضافة الفاتورة بنجاح

source: Search category
ar: البحث عن فئة

source: Status
ar: الوضع

source: Failed
ar: فشل

# successS
source: Success
ar: نجاح

# billerAlreadyExistsMessage
source: Biller already exists with the same billing number
ar: يوجد لديك فاتورة مخزنة بنفس الرقم المرجعي

source: Search bill
ar: البحث عن فاتورة

source: Nick name can only contain alphanumerics
ar: يجب أن يحتوي الأسم المستعار على حروف و أرقام فقط

# billPaymentSorryMessage
source: We are sorry. We were unable to complete your payment. Please refer to your Blink account statement and your Biller account statement to check the status of your payment. You can reach out to our Engagement team for support.
ar: متأسفين. لم نتمكن من اتمام العملية. يرجى العودة إلى كشف حركات حسابك في بلينك وعند المفوتر لمعرفة حالة العملية. فريقنا موجود لمساعدتك عند الحاجة

source: Account
ar: حساب

# letsGiveANameToYourCliqId
source: Let’s give a name to your new CliQ ID
ar: خلينا نختار اسم مستعار لحسابك في كليك

source: Please enter your mobile number
ar: ادخل رقم موبايلك

source: Suspended
ar: معلق

source: Active
ar: فعال

source: CLIQ ID UPDATE
ar: تحديث الاسم المستعار

# cliqIDmobileNOUpdated
source: CliQ ID Mobile Number has been updated
ar: تم تحديث رقم الموبايل المربوط بخدمة كليك

# amountShouldBetween
source: Amount should be between
ar: المبلغ يجب ان يكون بين

source: Amount should be more than
ar: المبلغ يجب ان يكون اكثر من

source: Amount should be less than or equal to
ar: المبلغ يجب ان يكون اقل او يساوي

source: View History
ar: الحركات السابقة
