Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

# uploadDocWithinTendays
source: You have opened your Blink account! Please upload the required documents within 10 days and get your debit card issued.
ar: تم فتح حسابك على Blink. حمّل الوثائق المطلوبة خلال 10 أيام لتحصل على بطاقة الدفع المباشر.

# myCreditCard
source: My Visa Credit Card
ar: بطاقتي الائتمانية

source: Min. Due
ar: الحد الأدنى المستحق

source: Total Due
ar: الإجمالي المستحق

source: Paid to
ar: الدفع الى

# accountNumber
source: Account No.
ar: رقم الحساب

source: No due Amount
ar: لا يوجد مبلغ مستحق

# invalidAccountBalance
source: Account Balance is less than pay balance.
ar: رصيد الحساب أقل من رصيد الدفع

source: Transaction Period
ar: الفترة الزمنية للحركات السابقة

source: Permanent residence
ar: العنوان الدائم

source: Call scheduled!
ar: تم تحديد موعد المكالمة

# callScheduledNote
source: Your account will be processed after the video call is completed.
ar: رح يتم معالجة حسابك بعد إنهاء المكالمة

# preferredDateSmall
source: Preferred Date
ar: التاريخ المفضل

source: Session Timeout.
ar: انتهت الجلسة

# errorModelNotCorrect
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-model)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-model)

# unauthorize
source: Oops! We are unable to authorize you. User might not be registered or something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-u)
ar: عفواً! مش قادرين نتعرف عليك. المشترك غير مسجل او صار خلل. حاول كمان مرة بعدين أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-u)

# enterValidUserName
source: You have entered an invalid username. Please try again.
ar: خطأ في اسم المستخدم. حاول مرة ثانية.

# invalidAccountID
source: Invalid account. Please try another account
ar: خطأ في الحساب. حاول مرة ثانية.

# errorWhileGettingRetailCIF
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-009)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-009)

# invalidProductId
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-011)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-011)

# residentInfoNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-012)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-012)

# invalidProductShortCode
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-015)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-015)

# maximumAccountOpeningExceed
source: You have reached the maximum number of accounts permitted. Unfortunately, you cannot open a new account.
ar: وصلت للحد الأقصى من عدد الحسابات. للأسف ما رح تقدر تفتح حساب جديد.

# maximumAgeOfUser
source: Maximum age of User must be
ar: الحد الأدنى للعمر هو 18 سنة. بنستناك بعيد ميلادك الـ 18.

source: for this Product, cannot proceed.
ar: الحد الأدنى للعمر هو 18 سنة. بنستناك بعيد ميلادك الـ 18.

# residentCountryRestricted
source: Sorry, this product is restricted to specific resident countries only.
ar: عفواً، المنتج مخصص لدول معينة فقط.

# nationalityRestricted
source: Sorry, this product is restricted to specific nationalities only.
ar: عفواً، المنتج مخصص لجنسيات معينة فقط.

# idNoBlacklisted
source: It seems your account is under review. Please contact our Engagement Team on 06-5200100 for more information.
ar: حسابك قيد المراجعة. تواصل معنا على 5200100-06 لتعرف أكتر.

# errorWhileCheckingIDNoBlacklisted
source: It seems your account is under review. Please contact our Engagement Team on 06-5200100 for more information.
ar: حسابك قيد المراجعة. تواصل معنا على 5200100-06 لتعرف أكتر.

# notAllowedToOpenAccount
source: You cannot proceed with this request. Please contact our Engagement Team on 06-5200100 for more information.
ar: ما رح تقدر تكمّل طلبك. تواصل معنا على 5200100-06 لتعرف أكتر.

# idCardScanningError
source: We were unable to verify your ID. Please scan your ID again or contact our Engagement Team on 06-5200100.
ar: مش قادرين نتحقق من هويتك. امسح الهوية كمان مرة او تواصل معنا على 5200100-06 لتعرف أكتر.

# invalidIssuerCountry
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-024)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06

# invalidDocument
source: The document is invalid. Please try another document or contact our Engagement Team on 06-5200100.
ar: الوثيقة غير صالحة. تواصل معنا على 06-5200100 لتعرف أكتر.

# invalidIdCardCannotProceed
source: We were unable to verify your ID card. Please contact our Engagement Team on 06-5200100.
ar: مش قادرين نتحقق من هويتك. تواصل معنا على 5200100-06 لتعرف أكتر.

# businessRulesNotImplementedAgainstCompanyId
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-028)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-028)

# useValidId
source: Your ID is expired. Please try again after renewing your ID.
ar: هويتك منتهية الصلاحية. حاول بعدين لما تجددها.

# guardianAgeMustBe
source: Age must be greater than 18 to proceed.
ar: للاستمرار، لازم يكون العمر أكبر من 18 سنة.

# profileStatusNotFound
source: It seems some information is missing. Please check and try again or contact our Engagement Team from the app or call 06-5200100.
ar: في معلومات ناقصة. تأكد وحاول كمان مرة أو تواصل معنا على 06-5200100

# invalidNationalIdCard
source: We were unable to verify the ID card. Please scan again or contact our Engagement Team on 06-5200100.
ar: مش قادرين نتحقق من هويتك. تواصل معنا على 06-5200100 لتعرف أكتر.

# idCardIsExpired
source: ID is expired. Please try again with a valid ID.
ar: هويتك منتهية الصلاحية. حاول بعدين لما تجددها.

# lessThanPrimary
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-153)
ar: عفواً! صارخطأ. حاول كمان مرة بعدين أو تواصل معنا على التطبيق أو بالاتصال على 06-5200100 . (Err-153)

# invalidNationality
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-154)
ar: عفواً! صارخطأ. حاول كمان مرة بعدين أو تواصل معنا على التطبيق أو بالاتصال على 06-5200100 . (Err-154)

# wsChildError
source: An error occurred while issuing your supplementary Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية التابعة Rebellious Red التابعة. حاول كمان مرة. (Err-155)

# createCardError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-156)

source: primary not complete
ar: خطوة أساسية غير مكتملة

# invalidSupplementaryCardId
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-158)

# setContactLessZeroError
source: An error occurred while issuing your supplementary Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية التابعة Rebellious Red التابعة. حاول كمان مرة. (Err-159)

# contactlessAlreadyDone
source: A supplementary card with the same details already exists. Please check and try again.
ar: البطاقة التابعة غير موجودة. تأكد وحاول كمان مرة.

# step2NotDoneCreditCard
source: An error occurred while issuing your supplementary Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية التابعة Rebellious Red التابعة. حاول كمان مرة. (Err-161)

# processLoanStepNotDone
source: An error occurred while issuing your supplementary Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية التابعة Rebellious Red التابعة. حاول كمان مرة. (Err-162)

# creatingShippmentError
source: An error occurred while issuing your supplementary Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية التابعة Rebellious Red التابعة. حاول كمان مرة. (Err-163)

# platformNotFound
source: An error occurred while issuing your supplementary Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية التابعة Rebellious Red التابعة. حاول كمان مرة. (Err-164)

# transactionNotAllowed
source: Your Trasaction is not Allowed
ar: الحركة غير مسموحة

# unableToProceedTransaction
source: An error has occurred and we are unable to proceed with the transaction
ar: خطأ! الحركة غير ممكنة حالياً.

# unableToCompleteTransaction
source: An error has occurred and we are unable to complete the transaction
ar: خطأ! الحركة غير ممكنة حالياً.

# getLoanPaymentError
source: GetLoanAPI PAYMENT API Error
ar: خطأ GetLoanAPI PAYMENT API

# processLoanError
source: ProcessLoanAPI PAYMENT API Error
ar: خطأ في ProcessLoanAPI PAYMENT API

# customerNotEligible
source: You are not eligible for this service. Please contact our Engagement Team from the app or call 06-5200100.
ar: الخدمة غير متاحة إلك حالياً. الرجاء التواصل معنا على 5200100-06

# loanNotActive
source: Loan Account Is Not Active
ar: حساب القرض غير فعال

# retrieveInstructionDetails
source: An error occurred while retrieving your standing instruction details. Please try again later.
ar: خطأ خلال استرداد تفاصيل التعليمات الثابتة. حاول كمان مرة

# edrawApiGotWrong
source: An Error has Occured while EDraw API get wrong
ar: حدث خطأ أثناء حدوث خطأ في EDraw API

# esettlementGoneWrong
source: An Error has Occured while ESettlement API get wrong
ar: حدث خطأ أثناء حدوث خطأ في ESettlement API

# amountLimitError
source: Amount Should be Greater then or equal to minimum Amount
ar: المبلغ لازم يكون أكبر من أو يساوي الحد الأدنى للسداد

# amountGreaterThanOutstanding
source: Amount Should be Not Greater then Total OutStandings
ar: المبلغ لازم ما يزيد عن الحد الاعلى

# response1Required
source: It seems you missed some of the required FATCA information. Please check again and ensure all information is provided.
ar: معلومات FACTA ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

# response2Required
source: It seems you missed some of the required FATCA information. Please check again and ensure all information is provided.
ar: معلومات FACTA ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

# response3Required
source: It seems you missed some of the required FATCA information. Please check again and ensure all information is provided.
ar: معلومات FACTA ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

# response4Required
source: It seems you missed some of the required FATCA information. Please check again and ensure all information is provided.
ar: معلومات FACTA ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

# response5Required
source: It seems you missed some of the required FATCA information. Please check again and ensure all information is provided.
ar: معلومات FACTA ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

# residenceCountryNotFound
source: Residence country not found. Please choose another country or contact our Engagement Team for help 06-5200100.
ar: دولة الإقامة غير موجودة. اختار دولة أخرى أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06

# noSignatureFound
source: It seems your signature on the FATCA form is missing. Please check that you provided the signature or contact or Engagement Team for help 06-5200100.
ar: توقيعك على نموذج FACTA غير موجود. تأكد من إنك تزودنا بالتوقيع أو تواصل معنا على 5200100-06

# fatcaDetailNotFound
source: It seems you missed some of the required FATCA information. Please check again and ensure all information is provided.
ar: معلومات FACTA ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

# invalidMobileCode
source: It seems the mobile number you provided in the FATCA form is incorrect. Please check again and ensure the number is correct.
ar: رقمك على نموذج FACTA غير صحيح. تأكد من إنك تزودنا بالرقم الصحيح.

# invalidLivelinessSCore
source: Oops! The picture quality is not clear. Please try again.
ar: عفوًا! جودة الصورة غير واضحة. حاول كمان مرة!

source: Invalid FaceMatch Score
ar: الوجه غير متطابق

# fingerPrintAlreadyExistForDevice
source: Biometric already exists for this device, please log in using your email and password
ar: في مشكلة بعملية تسجيل الدخول بالبصمة. الرجاء تسجيل الدخول باستخدام الإيميل وكلمة المرور، وبعدين ادخل على إعدادات الملف الشخصي وعطّل ثم فعل الدخول بالبصمة. إذا واجهتك أي مشكلة تواصل معنا على 5200100-06

# fingerPrintNotFound
source: Biometric not found, please log in using your email and password
ar: في مشكلة بعملية تسجيل الدخول بالبصمة. الرجاء تسجيل الدخول باستخدام الإيميل وكلمة المرور، وبعدين ادخل على إعدادات الملف الشخصي وعطّل ثم فعل الدخول بالبصمة. إذا واجهتك أي مشكلة تواصل معنا على 5200100-06

# jobDetailsNotFound
source: It seems you missed some of the required employment information. Please check again and ensure all information is provided.
ar: المعلومات الوظيفية المطلوبة ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

# accountPurposeNotFound
source: It seems you missed some information relating to purpose of opening your account. Please check again and ensure all information is provided.
ar: المعلومات المطلوبة لسبب فتح الحساب ناقصة. تأكد من إنك تزودنا بالمعلومات الكاملة.

source: Id Card Data Not Found
ar: بيانات الهوية الشخصية غير موجودة

source: Customer Preference Not Found
ar: خيارات العملاء غير موجودة

# invalidMinimumAge
source: The minimum age allowed to proceed is 18. Please come back on your 18th birthday. We'll be here waiting.
ar: الحد الأدنى للعمر هو 18 سنة. بنستناك بعيد ميلادك الـ 18.

# invalidMaximumAge
source: Sorry, this product is restricted to a specific age only.
ar: المنتج محدد لفئة عمرية معينة.

# invalidAccountLimit
source: The account limit has been exceeded.
ar: تم تجاوز الحد الأقصى للحساب.

# applicationUnderReview
source: Your application is under review. Please bear with us.
ar: طلبك قيد المراجعة. خليك معنا!

# rimNoTakenByOtherUser
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-054)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-054)

# errorCreatingWorkSpace
source: Error while creating Workspace
ar: خطأ خلال إنشاء مساحة العمل

# errorCreatingDocuments
source: Error while creating Documents
ar: خطأ خلال إنشاء الوثائق

# errorUpdatingCategoryCif
source: Error while updating category CIF
ar: خطأ خلال تحديث فئة CIF

# errorUpdatingCategory
source: Error while updating category
ar: خطأ خلال تحديث الفئة

# notRegisteredBank
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-059)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-059)

# providedCountryNotAllowed
source: It seems there is an issue with the country code you've entered. Please try another country code or contact our Engagement Team on 06-5200100.
ar: خطأ في رمز الدولة. حاول تكتب الكود الصحيح أو تواصل معنا على 5200100-06

# invalidOtpNetwork
source: You have entered an invalid code. Please try again.
ar: رمز غير صحيح. حاول كمان مرة.

# invalidOtpCodeNetwork
source: You have entered an invalid code. Please try again.
ar: رمز غير صحيح. حاول كمان مرة.

# otpRequestedManyTime
source: You have exceed the number of times allowed to enter the code. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: تجاوزت عدد المرات المسموح فيها لإدخال الكود. حاول بعد فترة أو تواصل معنا على التطبيق أو بالاتصال على 5200100-06

# otpExpiredNetwork
source: The code you have entered is expired. Please re-send code and try again.
ar: الكود منتهي الصلاحية. حاول كمان مرة.

# notAllowedToLogin
source: You are Not Allowed to Login Please contact our engagement team
ar: تسجيل الدخول غير مسموح إلك. تواصل معنا.

source: IP Address Call Internal Server Error
ar: خطأ في عنوان IP

# applicationInProcess
source: Your Application Is In Process
ar: طلبك قيد المعالجة

# noAccountFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-071)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-071)

# errorUpdatingAccount
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-073)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-073)

# invalidSignatureNetwork
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-074)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-074)

# noATMData
source: ATM data cannot be retrieved. Please try again later.
ar: مش قادرين على استرداد بيانات الصراف الآلي. حاول بعدين.

source: Not Verified
ar: لم يتم التحقق

# otpLimitExceedNetwork
source: You have exceed the number of times allowed to request a code. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: تجاوزت عدد المرات المسموحة لطلب الكود. حاول بعدين أو تواصل معنا على التطبيق أو بالاتصال على 5200100-06

# invalidOtpReq
source: You have entered an invalid code. Please try again.
ar: رمز غير صحيح. حاول كمان مرة.

# imageNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-080)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-080)

# documentsNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-081)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-081)

# invalidEmailNetwork
source: You have entered an invalid email address.
ar: إيميل غير صحيح

# invalidMobileNo
source: You have entered an invalid mobile number.
ar: رقم موبايل غير صحيح

# invalidCurrentPass
source: The password you entered is incorrect. Please try again or click on "Forgot password?" to change your password.
ar: كلمة المرور اللي أدخلتها غير صحيحة. حاول كمان مرة أو اختر "نسيت كلمة المرور" من الصقحة الرئيسية.

# noRequestFoundRTP
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-086)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-086)

# isoNationalityNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-087)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-087)

source: Error while Issue Card
ar: خطأ خلال إصدار البطاقة

# errorWhileGettingXCSCustomerDetails
source: Error while getting XCS Customer Card Details
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-089)

# noDebitCardRecordFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-090)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-090)

# errorEuronetCustomerCardDetails
source: Error while getting EURONET Customer Card Details
ar: خطأ خلال الحصول على معلومات البطاقة من برنامج EURONET

# errorSettingPinEuronet
source: Error while setting your Pin, please try again
ar: خطأ خلال إعداد الرمز السري PIN. حاول كمان مرة بعدين.

# invalidCardId
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-093)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-093)

# invalidFourDigit
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-094)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-094)

# contactlessError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-095)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-095)

source: Card Info Error
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-096)

# errorGettingCardInfo
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-097)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-097)

# loanAccountListNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-098)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-098)

# primaryCardNotActive
source: Please activate your primary Rebellious Red credit card to process your request.
ar: فعل بطاقتك الائتمانية Rebellious Red لإكمال طلبك.

# relativeIdError
source: Please make sure you scan the supplemenary cardholder ID instead of your ID.
ar: تأكد من إنك مسحت هوية حامل البطاقة التابعة، مش هويتك.

# primaryLoanAccListNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-148)

# errorCreateCreditCard
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين.

# settingContactLessError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-100)
ar: عفواً! صارخطأ. حاول كمان مرة بعدين أو تواصل معنا على التطبيق أو بالاتصال على 06-5200100 . (Err-100)

# errorInGetCardInfoNet
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-101)

# errorUpdatingLimits
source: Please unfreeze your card to be able to update your card limits.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-103)

# errorUpdatingCardStatusRuleEngine
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-104)

# noDebitCardFound
source: Something wrong with your Yellow Sun debit card information. Please contact our Engagement Team from the app or call 06-5200100.
ar: خطأ بمعلومات بطاقة الدفع المباشر Yellow Sun. تواصل معنا من التطبيق أو بالاتصال على 5200100-06

# errorWhileUpdatingPinStatusRE
source: Oops! There seems to be an issue with the connectivity. Please try again later.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-106)

# errorWhileUpdatingCardStatusNI
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-107)
