Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

# locationServiceDisabled
source: Location services are disabled. Please allow access to Blink
ar: خدمة تحديد المواقع معطلة. الرجاء تفعيلها على Blink

source: MIN. DUE BY
ar: الحد الأدنى للدفعة قبل تاريخ

# manageContactsSettings
source: Manage Contacts
ar: أصدقائي

source: Share PDF
ar: مشاركة ملف PDF

# requestedMoneyVia
source: Request money via
ar: طلب أموال من خلال

source: Activity
ar: حركة

source: Notifications
ar: إشعارارت

# acknowledgeBeforeFreezingCard
source: About freezing your card:
ar: عن تجميد بطاقتك

# cardcantBeUsedForTransactions
source: While frozen, your card can't be used for any transactions.
ar: خلال تجميد البطاقة، ما رح تقدر تستخدمها لأي حركة.

# directDebitsWontBeMade
source: While frozen, direct debits linked to this card won't be permitted. e.g. a direct debit from your Blink account to your gym or mobile carrier.
ar: خلال تجميد البطاقة، ما رح تقدر تستفيد من عمليات الدفع المباشر المربوطة عليها. مثال: الدفع المباشر من Blink للنادي الرياضي أو شركة الاتصالات.

# freezeAndActiveAtAnyTime
source: You can unfreeze and activate your card at anytime.
ar: بتقدر تفك تجميد بطاقتك وتفعلها بأي وقت.

source: Payment Activity
ar: حركة دائمة

# allTransaction
source: All Transactions
ar: كل الحركات

source: All Time
ar: كل الأوقات

# sendMoneyNotSuccessful
source: Your attempt to send money was unsuccessful.
ar: محاولتك لإرسال الأموال غير ناجحة

# tryAgainLater
source: There was an issue with your payment, please try again. If you need help, contact Blink Engagement Team.
ar: في مشكلة بدفعتك، حاول كمان مرة. إذا بدك مساعدة، تواصل معنا.

# ibanNotBlink
source: IBAN is not in Blink
ar: رقم الأيبان غير موجود على Blink

# ibanOutsideBlink
source: We've found that the IBAN you entered is not within Blink. You will be able to send money outside Blink, soon! For now, invite the recipient to join our community.
ar: رقم الأيبان اللي دخلته غير موجود على Blink. رح تقدر تحوّل الأموال لحسابات خارجية قريباً. بتقدر هلأ تدعو صاحبك لينضم لعيلتنا!

# emptyIbanOrMobile
source: IBAN / Mobie / Alias should not be empty
ar: لازم تكتب الـ الأيبان/ رقم الموبايل/ الاسم المستعار

# emptyPurpose
source: Purpose should not be empty
ar: لازم تكتب السبب

# emptyPurposeDetail
source: Purpose detail should not be empty
ar: لازم تكتب تفاصيل السبب

source: Download Statement
ar: تنزيل كشف الحساب

source: Statement PDF
ar: ملف كشف الحساب PDF

# beneficiaryNotFound
source: Recipient not found. Please try another recipient.
ar: المستقبِل غير موجود. حاول مع حدا جديد.

# errorWhileBalanceInquiry
source: An error occurred while trying to get your account balance. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: خطأ خلال عملية استعراض رصيد الحساب. حاول كمان مرة بعدين أو تواصل معنا من التطبيق أو بالاتصال على 06-5200100

# insufficientBalance
source: insufficient Balance (Err-89)
ar: الرصيد غير كافي (Err-89)

source: Credit card delivered
ar: تم تسليم البطاقة الائتمانية

# debitCardDeliveredDate
source: Debit Card delivered
ar: تم تسليم بطاقة الدفع المباشر

# insufficientBalanceTransfer
source: You do not have sufficient balance to make payment.
ar: ما عندك رصيد كافي لتكمل الدفعة.

source: Invalid Beneficiary
ar: المستفيد خطأ

source: Invalid requested amount
ar: المبلغ المطلوب خطأ

# swipeToSend
source: Swipe up to send money
ar: اسحب الشاشة لفوق لتحوّل الأموال

# swipeToRequest
source: Swipe up to request money
ar: اسحب الشاشة لفوق لتطلب الأموال

# swipeUpToViewTransaction
source: Swipe up to view transactions
ar: اسحب الشاشة لفوق لتستعرض الحركات

# freezeTheCard
source: Freeze this card?
ar: بدك تجمد البطاقة؟

source: Freeze this card
ar: تجميد البطاقة

# pleaseSelectTheReason
source: Please select the cancellation reason
ar: اختار سبب الإلغاء

source: Please agree to the term and condition
ar: وافق على الشروط والأحكام

# freezeDebitCardDescription
source: Here is some information for you to acknowledge before freezing your card. • In freezed state, your card can’t be used for any transactions. •In freezed state, Direct Debits which were set up from this card number won’t be made, e.g. a Direct Debit to your gym or mobile carrier. • You can unfreeze and activate your card at any time.
ar: مجموعة من المعلومات اللي لازم تعرفها قبل ما تجمّد بطاقتك. * خلال التجميد، ما رح تقدر تستخدم بطاقتك لأي حركة. * خلال التجميد، ما رح تقدر تستفيد من عمليات الدفع المباشر المربوطة على البطاقة، مثل: دفعات النادي الرياضي وشركة الاتصالات. * بتقدر تفك تجميد البطاقة وتفعلها بأي وقت.

# cancelTheCard
source: Cancel this card?
ar: إلغاء البطاقة؟

source: Back to Registration
ar: العودة إلى التسجيل

# cancelCardDesc
source: Canceling this card will permanently deactivate the card and will be removed from your card list and Apple Pay services. if you proceed and wish to issue a new card, we will deliver the new card to your address, and you will have to add it to Apple Pay if you wish to use the service.
ar: .إلغاء البطاقة راح يعطلها بشكل دائم ورح يتم شطبها من قائمة بطاقاتك ومن خدمة أبل باي. إذا بدك تستمر, رح توصلك بطاقة جديده على عنوانك

source: Reason of Cancellation
ar: سبب الإلغاء

# requestNewCardImmediately
source: I would like to request new card immediately
ar: بدي أطلب بطاقة جديدة فوراً

source: Request supplementary card
ar: طلب بطاقة تابعة

# changeLinkedMobileNo
source: Change linked mobile number
ar: تغيير رقم الموبايل المرتبط

source: Change linked account
ar: تغيير الحساب المرتبط

# actionComeToYouSoon
source: The actions with 🔴 will be made available to you soon
ar: الخدمات الي جنبها 🔴 رح تتوفر قريباً

source: Debit Card Settings
ar: إعدادات بطاقة الدفع المباشر

source: Credit Card Settings
ar: إعدادات البطاقة الائتمانية

source: Cancel this card
ar: إلغاء البطاقة

# dontNeedMyCardAnymore
source: I don't need my card anymore
ar: بطلت محتاج بطاقتي

# pleaseHelpUsImproveServices
source: Please help us to improve our services: Free text (if this can be applied)
ar: ساعدنا لنطوّر خدماتنا: مساحة لادخال أي نص (اذا بالإمكان تطبيقها)

# dissatisfiedWithOverallBankingExp
source: I'm dissatisfied with the overall banking experience
ar: أنا مش راضي عن التجربة المصرفية بشكل عام

# dissatisfiedWithDigitalPlatform
source: I'm dissatisfied with the digital platform
ar: أنا مش راضي عن المنصة الرقمية

# controlMyExpensesInOtherWays
source: I'm trying to control my expenses in other ways
ar: عم بحاول أتحكّم بمصاريفي بطرق أخرى

source: High interest,fees,and charges
ar: فوائد ورسوم وتكاليف مرتفعة

# feelThatCreditLimitLow
source: I feel the credit limit is low
ar: بعتقد إنه سقف البطاقة الائتمانية قليل

# tooManyRecurrentDeclined
source: There are too many recurrent declined transactions
ar: في عدد كبير من الحركات المرفوضة المتكررة

source: Manage card limits
ar: إدارة سقوف البطاقات

# exchangeRateForCurrencies
source: The exchange rate for other currencies is high
ar: سعر صرف العملات الأخرى مرتفع

source: Manage card PIN
ar: إدارة الرمز السري PIN للبطاقة

source: Request supplementary card
ar: طلب بطاقة تابعة

source: Increase credit limit
ar: رفع سقف الائتمان

# convertBalanceToInstalments
source: Convert purchases to instalments
ar: تقسيط المشتريات

source: Change linked mobile number
ar: تغير رقم الموبايل المرتبط

source: Change country restriction
ar: تغيير القيود المفروضة من الدولة

source: Manage settlement
ar: إدارة نسب السداد

# changeLinkAccount
source: Change linked account
ar: تغيير الحساب المرتبط

# reportCardIssue
source: Report stolen or lost card
ar: الإبلاغ عن سرقة أو ضياع بطاقة

source: Engagement Team
ar: فريق التواصل

# engagementTeamDescription
source: Please select your preferred communication. Your call or chat may be monitored or recorded to ensure the quality of service.
ar: الرجاء اختيار طريقة التواصل المفضلة. رح يتم مراقبة أو تسجيل مكالمتك أو محادثتك لضمان الجودة.

source: Voice Call
ar: مكالمة صوتية

source: Live Chat
ar: محادثة مباشرة

source: Voice Chat
ar: محادثة صوتية

# engagementTeamGettingReady
source: Our Engagement Team is getting ready
ar: فريقنا مستعد لخدمتك

# weWillConnectYou
source: We will connect you in Blink...
ar: رح نتواصل معك خلال لحظات

# thankYouForWaiting
source: Thank you for waiting, the voice call will start automatically
ar: شكراً على الانتظار، مكالمتك الصوتية رح تبدأ تلقائياً

source: Swipe down to cancel voice call
ar: اسحب الشاشة لتحت لإلغاء المكالمة الصوتية

source: Call has ended
ar: تم إنهاء المكالمة

# thankYouForContacting
source: Thank you for contacting Blink Engagement Team. Feel free to contact us anytime.
ar: شكراً لاتصالك مع فريق Blink. ما تتردد بالاتصال فينا بأي وقت.

source: Unblock card PIN
ar: فك حظر الرمز السري PIN على البطاقة

source: Change card PIN
ar: تغيير الرمز السري PIN البطاقة

source: Unblock PIN?
ar: فك حظر الرمز السري PIN

# unBlockPinDescription
source: Your card PIN has been blocked due to security measures. To continue using your PIN and payment services, please proceed to unblock your PIN. Once you unblock your PIN, your first transaction will be rejected due to technical limitations.
ar: لقد تم ايقاف الرمز السري للبطاقة لإحتياطات أمنية. للاستمرار باستخدام الرمز السري لاجراء عمليات الشراء يرجى القيام باعادة تفعيل الرمز السري. عند اعادة تفعيل الرمز السري، قد يتم رفض أول عملية باستخدامه.

# cardPinSucccesFullyUnblocked
source: You have successfully unblocked your card's PIN
ar: تم فك حظر الرمز السري PIN بنجاح

# cardPinSucccesFullyUnblockedDesc
source: Your first transaction will be declined, don't worry, the second one will work
ar: أول حركة مالية رح تنرفض, ما تقلق، الثانية رح تمشي بنجاح

source: Back to Dashboard
ar: العودة لشاشة التحكم

source: ATM Withdrawal
ar: سحب من صراف آلي

source: Merchant Payments
ar: دفعات المحلات

source: Online Purchase
ar: الشراء أونلاين

# contactLessPayments
source: Contactless Payment
ar: دفع بدون لمس

source: Daily Limit
ar: السقف اليومي

# maximumLimit
source: Maximum {maximumLimit} JOD
ar: أقصى {maximumLimit} دينار

# requestNotCompleted
source: Your Request Is Not Completed
ar: طلبك غير مكتمل

# invalidLimitValue
source: Limit value cannot be set greater than max limit value
ar: القيمة لازم تكون أقل من الحد الاقصى للبطاقة

source: Enter new card PIN and confirm PIN
ar: أدخل الرمز السري PIN الجديد وأكّد عليه

source: new pin
ar: رمز سري PIN جديد

source: CONFIRM new pin
ar: تأكيد الرمز السري PIN الجديد

# emptyConfirmPin
source: Enter pin again
ar: أدخل الرمز السري PIN كمان مرة

# cardPinChangedSuccessfully
source: You have successfully changed your card's PIN
ar: تم تغيير الرمز السري PIN على بطاقتك بنجاح

# cardPinChangedDesc
source: Visit the nearest ATM to activate your new PIN
ar: زور أقرب صراف آلي عشان تفعل الرقم السري الجديد

source: Limit exceeded
ar: تم تجاوز السقف

# whatRelationshipWithCardHolder
source: What is your relationship with the cardholder?
ar: شو علاقتك مع حامل البطاقة؟

source: Relationship
ar: العلاقة

# provideSupplementaryCardId
source: Please scan supplementary cardholder's ID
ar: امسح هوية حامل البطاقة التابعة

# setupAndPersonalizeYourNewCreditCard
source: Complete the details to issue the supplementary card
ar: أكمل المعلومات لإصدار البطاقة التابعة

source: Credit Limit Settings
ar: إعدادات سقف الائتمان

# minimumSettlements
source: MINIMUM PAY BACK
ar: الحد الأدنى للسداد

source: (Optional)
ar: اختياري

source: Select Credit Limit Settings
ar: اختار إعدادات سقف الائتمان

source: Select Minimum Settlement
ar: اختار الحد الأدنى لنسبة السداد

source: Empty Nickname
ar: خانة الاسم المستعار فارغة

source: Your card is ready!
ar: بطاقتك صارت جاهزة!

# aramaxWillConnectYouSoon
source: Aramex will contact you soon to deliver your physical card.
ar: رح يتواصلوا معك من أرامكس قريباً ليوصلولك بطاقتك.

# youWillReceiveCardPinViaSms
source: Didn't receive an SMS? Contact our Engagement Team.
ar: ما وصلتك رسالة SMS؟ تواصل معنا.

# applyCreditCard
source: APPLY FOR CREDIT CARD
ar: التقدّم لبطاقة ائتمانية

source: APPLY DEBIT CARD
ar: التقدّم لبطاقة دفع مباشر

source: Set up and personalize your new debit card
ar: اصدر بطاقة الدفع المباشر

# yourApplicationInReview
source: Your application is under review
ar: طلبك قيد المراجعة

# callHangupError
source: Error occurred during hangup call
ar: خطأ خلال إنهاء المكالمة

# infobipInitError
source: Error occurred while Initialization
ar: خطأ خلال التجهيز للمكالمة

# establishCallError
source: Error occurred while establish call
ar: خطأ خلال بدء المكالمة

# getCallDurationError
source: Error occurred while get call duration
ar: خطأ خلال استعراض زمن المكالمة

# getCallTokenError
source: Error occurred during getting token
ar: خطأ خلال الحصول على الرمز

# weWillNotifyOnceReady
source: We will notify you once it's ready!
ar: رح نتواصل معك لما تكون جاهزة!

# emptyIncome
source: Enter total annual income
ar: أدخل إجمالي الدخل السنوي

# accountReadyMsg
source: Account ready!
ar: حسابك صار جاهز!

# yourFreeVirtualDebitCardHasBeenIssued
source: Your free virtual debit card has been issued, and the physical one is on its way.
ar: تم إصدار بطاقة الدفع المباشر الافتراضية، وبطاقتك الفعلية بطريقها إلك.

# passwordNotMeetCriteria
source: Your password does not meet the minimum requirements. Please try again.
ar: كلمة المرور ما حققت الحد الأدنى من المتطلبات. حاول كمان مرة.

# currentPasswordInvalid
source: Current password is invalid. Password does not meet requirement.
ar: كلمة المرور الحالية غير صالحة وما حققت الحد الأدنى من المتطلبات.

source: Select expected transaction
ar: اختار الحركات المتوقعة

source: Selfie Check!
ar: صورة سيلفي

# makeSureYourFaceFitsTheFrame
source: Make sure your eyes are level and well-opened.
ar: تأكد من إنك بتطلع على الكاميرا وفاتح عيونك منيح!

source: Error While Get Combo Values
ar: خطأ خلال الحصول على القيم

# userAlreadyExists
source: User Already Exist. Try Using Different Email
ar: المستخدم موجود أصلاً. حاول تستخدم إيميل مختلف

source: Please Try Again
ar: حاول كمان مرة

# foreignTaxIdNumber
source: Foreign Tax Identifying Number
ar: رقم تعريف الضريبة الأجنبية

# invalidForeignIdNumber
source: Please Enter Foreign Tax Identifying Number
ar: أدخل رقم تعريف الضريبة الأجنبية

# exemptionFromFatcaReporting
source: ExemptION from fatca reporting code
ar: الإعفاء من قانون الإبلاغ عن الامتثال الضريبي للحسابات الأجنبية

# invalidExemptionFromFatcaReporting
source: Enter Exemption From Fatca Reporting Code
ar: أدخل الإعفاء من قانون الإبلاغ عن الامتثال الضريبي للحسابات الأجنبية

# employerIdNumber
source: EMPLOYER IDENTIFICATION NUMBER
ar: رقم تعريف المؤسسة

# invalidEmployerId
source: Enter Employer Identification Number
ar: أدخل رقم تعريف المؤسسة

# errorWhileAccessingIdData
source: error while Accessing Id Card Data.
ar: خطأ خلال الوصول لبيانات الهوية الشخصية

# notAllowedCountry
source: ID card issuer is not allowed at this moment. Please try again with valid ID card issuer.
ar: مصدر الهوية الشخصية غير متوفر حالياً. حاول مرة ثانية مع مصدر آخر.

# blinkCreditCardTitle
source: Rebellious Red Credit Card
ar: بطاقة Rebellious Red الائتمانية

# getCardDelivered
source: Blink has made borrowing more accessible to everyone. With only a few steps, get your instant virtual credit card and we will deliver the physical one to your door step for free.
ar: الاقتراض صار أسهل مع Blink. بخطوات بسيطة، احصل على بطاقتك الائتمانية الافتراضية ورح نوصللك بطاقتك الفعلية لباب بيتك.

# authorize
source: I hereby acknowledge that I have read, understood, and accepted Blink’s Credit Card
ar: أقر بأنني قرأت وفهمت ووافقت على الشروط والأحكام العامة لبطاقات Blink الائتمانية

source: Credit Bureau
ar: وحدة الائتمان

# agreeData
source: and
ar: و

# creditTc
source: Terms & Conditions
ar: الشروط والأحكام

source: authorization.
ar: تفويض

# agreeTermsCondition
source: Please agree to terms and conditions.
ar: وافق على الشروط والأحكام

# applicationNotSuccessful
source: Unfortunately, your application was rejected.
ar: للأسف، تم رفض طلبك.

# excitingPromotion
source: We have an automated scoring model that generates a credit score based on your personal and credit information. We will review your score regularly and inform you when you can try again. Please stay tuned for exciting services coming your way from Blink!
ar: عنا نموذج تقييم آلي لإنشاء درجتك الائتمانية بناءً على معلوماتك الشخصية والائتمانية. رح نراجع نتيجتك بانتظام ونبلغك بالوقت اللي لازم تعيد فيه المحاولة. تابعنا لتستفيد من خدماتنا المميزة اللي بنحضرلك اياها على Blink.

# applyCreditCardTitle
source: APPLY FOR CREDIT CARD
ar: التقدّم لبطاقة ائتمانية

# personalizeCreditCard
source: You are eligible for the below maximum limit, complete the details to issue your card
ar: إنت مؤهل للسقف الاعلى التالي، أكمل المعلومات المطلوبة لإصدار بطاقتك

source: CREDIT LIMIT
ar: سقف الائتمان

source: MINIMUM SETTLEMENT
ar: الحد الأدنى للسداد

# emptyMinimumSettlement
source: Please select minimum settlement value
ar: الرجاء اختيار الحد الأدنى لقيمة السداد

# purposeDetailSmall
source: Purpose Details
ar: تفاصيل السبب

# purposeSmall
source: Purpose
ar: السبب

# nameOfBeneficiary
source: Name
ar: الاسم

source: Add nickname
ar: إضافة اسم مستعار

# errorDecryptCard
source: Error while decrypting card
ar: خطأ خلال فك تشفير البطاقة

# generateBlockPin
source: Error while generating block pin
ar: خطأ خلال إنشاء حظر الرمز السري PIN

source: Error While Getting FatcaCrs
ar: خطأ خلال الحصول على FACTA

# errorWhileGettingDashboard
source: An error has occurred While Getting Account DashBoard
ar: خطأ خلال الوصول على شاشة التحكم بالحساب

# mobileAlreadyExists
source: The mobile number you have entered already exists, please enter another number or try to login using your email and password if you have already tried to register previously.
ar: رقم الموبايل اللي أدخلته مستخدم من قبل. حاول تستخدم رقم جديد أو سجّل دخولك من خلال إيميلك وكلمة مرورك إذا كنت مسجّل من قبل.

# weDoNotRecommendToUsePreviousTenPass
source: You have entered one of the previous 10 passwords used. Please try a new password.
ar: أدخلت كلمة مرور مستخدمة سابقاً. حاول تستخدم كلمة جديدة.

# currentPasswordIncorrect
source: The current password entered is wrong. Please try again
ar: كلمة المرور اللي أدخلتها غير صحيحة. حاول كمان مرة.

# emptyNickName
source: Please add nickName
ar: الرجاء إضافة اسم مستعار

source: One final stop...
ar: خطوة أخيرة...

# yourApplicationInReviewNote
source: Your application is under review, we will notify you soon.
ar: طلبك قيد المراجعة، رح نخبرك قريباً.

source: Ref No.
ar: رقم المرجع

# biometricLoginDeactivated
source: Biometric login is successfully deactivated
ar: تم تعطيل تسجيل الدخول بالبصمة بنجاح.

# yourYellowSunDebitCardIssued
source: Your Yellow Sun debit card has been issued!
ar: تم إصدار بطاقة الدفع المباشر Yellow Sun

# enterIdNumberToResetPassword
source: Enter below details to reset your password
ar: أدخل المعلومات التالية لإعادة تعيين كلمة المرور

source: ID EXPIRY DATE
ar: تاريخ انتهاء الهوية

# letsCreateNewPass
source: Next, let’s create your new password
ar: خلينا نعمل كلمة مرور جديدة

source: Preparing your card...
ar: بطاقتك قيد التجهيز

# creatingCreditCardLimit
source: Creating your credit card limit
ar: إنشاء سقف بطاقتك الائتمانية

source: Issuing your credit card
ar: إصدار بطاقتك الائتمانية

# activatingCreditCard
source: Activating your credit card
ar: تفعيل بطاقتك الائتمانية

# cardApplyMsg
source: Aramex will contact you soon to deliver your physical card. You will receive your card PIN via SMS. You can contact our Engagement Team in case not received.
ar: رح يتواصلوا معك من أرامكس قريباً، ورح يوصلك الرمز السري PIN برسالة SMS. تواصل معنا إذا ما وصلتك البطاقة.

source: TOTAL USED AMOUNT
ar: إجمالي المبلغ المستغل

source: YOUR CARD LIMIT
ar: سقف بطاقتك

# applicationFailureMsg
source: We generated a score based on your personal and credit information which did not meet our criteria. We will review your score regularly and inform you when you become eligible. Please stay with us and enjoy Blink's services, more is coming your way!
ar: لقد تم تقيم طلبك بناءً على معلوماتك الشخصية والائتمانية وللأسف لم يتم الموافقه غليها. رح نراجع نتيجتك بانتظام ونبلغك بالوقت اللي لازم تعيد فيه المحاولة. تابعنا لتستفيد من خدماتنا المميزة اللي بنحضرلك اياها على Blink.

# emptyVerifyEmail
source: Email cannot be empty
ar: لازم تكتب الإيميل

# emptyVerifyExpiryDate
source: Expiry Date cannot be empty
ar: لازم تكتب تاريخ الانتهاء

# emptyVerifyNationalId
source: National Id cannot be empty
ar: لازم تكتب رقمك الوطني

# checkForgetPasswordError
source: Error While Forget Password
ar: خطأ خلال طلب تغيير كلمة المرور

# createPasswordSuccess
source: Your new password has been set.
ar: تم إعداد كلمة المرور الجديدة

# proceedToLogin
source: Proceed to the login page and use your new password to login.
ar: الاستمرار لصفحة تسجيل الدخول واستخدام كلمة المرور الجديدة

source: to Login Page
ar: إلى صفحة تسجيل الدخول

# deviceNotSupported
source: Jailbroken device detected
ar: تم اكتشاف جهاز كشف الحماية

# deviceNotSupportedNote
source: For protection of our customers, we have disabled Blink on high risk, jailbroken or rooted mobile devices. You may use Blink on another device or reset your device to its original settings.
ar: لحماية عملائنا ، قمنا بتعطيل Blink على الأجهزة عالية الخطورة. بتقدر تستخدم Blink على جهاز آخر أو تعمل إعادة ضبط لجهازك على إعداداته الأصلية.

source: Resident City
ar: مدينة الإقامة

source: You requested
ar: إنت طلبت

source: from
ar: من

# fromSingleLine
source: from
ar: من

# addRequestMoney
source: You don't have any contacts yet. Your Blink contacts can be saved while requesting money.
ar: ما عندك معارف. رح يتم حفظ قائمة المعارف بمجرد ما تبعثلهم طلب الأموال.

source: Error While Process Loan Request.
ar: خطأ خلال طلب القرض

source: Error While Getting Account Close Otp.
ar: خطأ خلال الحصول على كلمة المرور OTP

source: Card frozen
ar: البطاقة مجمدة

# toEnjoyCardLessPaymentDebit
source: To enjoy cardless payments, you can get your free virtual debit card and we’ll deliver the physical card to your door step
ar: لتتمتع بالدفع الإلكتروني بدون بطاقة، بتقدر تحصل على بطاقة الدفع المباشر الافتراضية، ورح نوصللك بطاقتك الفعلية لباب بيتك.

source: Request new debit card
ar: طلب بطاقة دفع مباشر جديدة

# ibanOrMobileOrAccount
source: IBAN / Mobile No. / Account
ar: الأيبان/ رقم الموبايل/ الحساب

# amountZero
source: Invalid amount
ar: مبلغ غير صحيح

source: Id Card Not Found
ar: هوية شخصية غير موجودة

# changeCardPinError
source: Change Chard Pin Error
ar: خطأ في تغيير الرمز السري PIN للبطاقة

source: Error while linking Debit Card
ar: خطأ خلال ربط بطاقة الدفع المباشر

# confirmPasswordNotMatch
source: Confirm password should be same as new password
ar: تأكد من مطابقة كلمات المرور

# passwordUpdate
source: Password is successfully updated
ar: تم تحديث كلمة المرور بنجاح

# invalidAnnualIncomeValue
source: Annual Income should be greater than 0
ar: الدخل السنوي لازم يكون أكبر من 0

source: Select Additional Income
ar: اختار الدخل الإضافي

source: Error While Get Status
ar: خطأ خلال تحديد الحالة

source: New device detected
ar: تم اكتشاف جهاز جديد

# newDeviceDetectedDesc
source: You’re attempting to log in from a new device. Would you like to switch access to this device?
ar: إنت عم بتحاول تسجّل دخولك من جهاز جديد. بدك تحوّل صلاحية الدخول للجهاز الجديد؟

source: SWITCH DEVICE
ar: تحويل الجهاز

source: Congratulations!
ar: مبروك!

# newDeviceRegisteredSuccessfully
source: Your new device has been successfully registered. You may proceed to your Dashboard.
ar: تم تسجيل جهازك الجديد بنجاح. بتقدر تنتقل هلأ لشاشة التحكم.

# supplementaryDebitcardSuccessDesc
source: Aramex will contact you soon to deliver your physical card. In the meantime, you can start using your virtual card immediately.
ar: رح يتواصلوا معك من أرامكس قريباً، حالياً بتقدر تستخدم بطاقتك الافتراضية فوراً.

# invalidIncomeSourceValue
source: Additional Income should be greater than 0
ar: الدخل الإضافي لازم يكون أكبر من 0

# invalidExpectedMonthlyIncomeSourceValue
source: Monthly Income should be greater than 0
ar: الدخل الشهري لازم يكون أكبر من 0

# userNotEligible
source: User is not eligible.
ar: المستخدم غير مؤهل
