Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: ACCOUNT REGISTRATION
ar: تسجيل الحساب

# selectCountryHeader
source: Hello! Which country are you from?
ar: مرحبا! إنت من أي دولة؟

# addMobileHeader
source: What’s your mobile number?
ar: شو رقم موبايلك؟

# enterOtpHeader
source: Enter the 6-digit code sent to
ar: أدخل الرمز المكون من 6 خانات

source: Mobile Number
ar: رقم الموبايل

# enterValidMobileNumber
source: You entered an invalid mobile number. Please try again.
ar: رقم الموبايل اللي دخلته غير صحيح. حاول كمان مرة.

source: Change My Number
ar: تغيير رقمي

# resendIn
source: Resend in {resendTime}
ar: إعادة الإرسال خلال {resendTime}

# enterValidOtp
source: Please enter valid otp
ar: يرجى إدخال كلمة مرور OTP الصحيحة

# createPasswordHeader
source: Next, let’s create your password
ar: خلينا نعمل كلمة مرور جديدة

source: CREATE PASSWORD
ar: إنشاء كلمة المرور

source: PASSWORD
ar: كلمة المرور

source: Please enter
ar: الرجاء إدخال

source: CONFIRM PASSWORD
ar: تأكيد كلمة المرور

source: PERSONAL DETAILS
ar: المعلومات الشخصية

# idVerificationInfoHeader
source: Grab your ID and let's get scanning
ar: جهّز هويتك عشان نصوّرها!

# idVerificationPlaceInfo
source: Make sure you're in a bright place
ar: تأكّد من إضاءة المكان اللي إنت فيه

# idScanInfo
source: Place your ID inside the frame
ar: حط بطاقتك داخل المستطيل

# onIdFit
source: Once fit, your ID will be scanned automatically
ar: رح يتم مسح الهوية تلقائياً لما تحطها داخل المستطيل

# termsAndConditions
source: I hereby authorize Blink to retrieve my data from the Civil Status and Passports Department.
ar: أفوّض Blink بالحصول على معلوماتي الشخصية من دائرة الأحوال المدنية والجوازات.

# confirmDetailsHeader
source: Please confirm your details below
ar: الرجاء تأكيد معلوماتك التالية

# name
source: NAME AS PER ID
ar: الاسم حسب الهوية

# nameHint
source: Please Enter Name
ar: اكتب اسمك

source: ID NUMBER
ar: رقم الهوية

# idHint
source: Please Enter ID Number
ar: اكتب رقم الهوية

# dob
source: DATE OF BIRTH
ar: تاريخ الميلاد

# dobHint
source: DD/MM/YYYY
ar: يوم/شهر/سنة

source: NATIONALITY
ar: الجنسية

# nationalityHint
source: Please Enter Nationality
ar: اكتب جنسيتك

source: EXPIRY DATE
ar: تاريخ الانتهاء

# expiryDateHint
source: Please Enter Expiry Date
ar: اكتب تاريخ الانتهاء

source: GENDER
ar: الجنس

# genderHint
source: Please Enter Gender
ar: أدخل الجنس

# enterAddressHeader
source: Where do you currently live?
ar: وين ساكن حالياً؟

source: RESIDENT COUNTRY
ar: الدولة

# residentCountryHint
source: Please Enter Resident Country
ar: أدخل الدولة

source: HOME ADDRESS
ar: عنوان البيت

# homeAddressHint
source: Please Enter Home Address
ar: أدخل عنوانك

source: STREET ADDRESS
ar: الشارع

# streetAddressHint
source: Please Enter Street Address
ar: أدخل اسم الشارع

# buildingNameOrNo
source: BUILDING NAME/NO
ar: رقم/ اسم العمارة

# buildingNameOrNoHint
source: Please Enter Building Name/Number.
ar: أدخل رقم/ اسم العمارة

# tellUsAboutYourJob
source: Next, tell us about your job
ar: احكيلنا عن شغلك

source: EMPLOYMENT STATUS
ar: الوضع الوضيفي

source: OCCUPATION
ar: الوظيفة

source: Please select
ar: الرجاء التحديد

source: MAIN SOURCE OF INCOME
ar: مصدر الدخل الرئيسي

source: MONTHLY INCOME
ar: الدخل الشهري

source: ANNUAL INCOME
ar: الدخل السنوي

source: PURPOSE OF ACCOUNT OPENING
ar: سبب فتح الحساب

source: JOD
ar: دينار أردني

source: EMPLOYER NAME
ar: اسم المؤسسة

source: EMPLOYER COUNTRY
ar: عنوان الوظيفة- البلد

source: EMPLOYER CITY
ar: عنوان الوظيفة- المدينة

source: EMPLOYER CONTACT
ar: رقم هاتف المؤسسة

source: ADDITIONAL SOURCE OF INCOME
ar: دخل إضافي

source: TOTAL ADDITIONAL INCOME
ar: إجمالي الدخل الإضافي

# employmentStatusSmall
source: Employment Status
ar: الوضع الوظيفي

source: Swipe down to cancel
ar: اسحب الشاشة لتحت للإلغاء

# occupationSmall
source: Occupation
ar: الوظيفة

# purposeOfOpeningAccount
source: Purpose of Account Opening
ar: سبب فتح الحساب

# additionIncomeSource
source: Additional Source of Income
ar: دخل إضافي

# taxationDetailsDescription
source: By law, you are needed to declare your taxation details
ar: حسب القانون، لازم تفصح عن معلوماتك الضريبية.

# areYouUSTaxResident
source: Are you a US Tax Resident?
ar: بتدفع ضرائب بأمريكا؟

# areYouUSTaxResidentHint
source: (e.g. Green Card Holder)
ar: عندك إقامة بأمريكا؟

# wereBornInUS
source: Were you born in the U.S.?
ar: مولود بأمريكا؟

# anyOtherCountryTaxResident
source: Are you Tax Resident in any other country than US or Jordan?
ar: بتدفع ضرائب بأي دولة أخرى غير الأردن وأمريكا؟

# taxationDeclaration
source: I confirm that my tax residency is accurate and agree to the Terms and Conditions of the bank.
ar: أؤكد على صحة معلوماتي الضريبية وأوافق على شروط وأحكام البنك.

# taxReportInfoDesc
source: Complete your tax report information below
ar: أكمل معلومات تقريرك الضريبي التالية:

source: TAX COUNTRY
ar: دولة الضريبة

# doYouHaveTinAvailable
source: Do you have TIN No available?
ar: عندك رقم تعريف ضريبي؟

source: TIN NO.
ar: رقم التعريف الضريبي

source: REASON OF UNAVAILABILITY
ar: سبب عدم توفر الرقم

source: EXPLAIN REASON
ar: السبب

source: Swipe to proceed
ar: اسحب الشاشة للاستمرار

# invalidEmploymentStatus
source: Select Employment Status
ar: اختار الوضع الوظيفي

# invalidOccupation
source: Enter Occupation
ar: اكتب الوظيفة

# invalidMainSourceIncome
source: Enter source of income.
ar: أدخل مصدر الدخل

# invalidMonthlyIncome
source: Enter monthly income
ar: أدخل الدخل الشهري

# invalidAnnualIncome
source: Enter Annual income
ar: أدخل الدخل السنوي

# invalidPurposeOfOpeningAccount
source: Select purpose of account opening
ar: اختار سبب فتح الحساب

# invalidEmployerName
source: Enter employer Name
ar: أدخل اسم المؤسسة

# invalidEmployerCountry
source: Select employer country
ar: اختار دولة المؤسسة

# invalidEmployerCity
source: Enter employer city
ar: أدخل مدينة المؤسسة

# invalidEmployerContact
source: Enter employer Contact
ar: أدخل رقم هاتف المؤسسة

# invalidAdditionSourceIncome
source: Select Additional Source Income
ar: اختار مصدر الدخل الإضافي

# invalidTotalAdditionalIncome
source: Enter total additional income
ar: أدخل إجمال الدخل الإضافي

source: Welcome to NeuBank
ar: أهلاً فيك بالبنك الرقمي

source: EMAIL ADDRESS
ar: الإيميل

source: or continue with
ar: أو تابع من خلال

source: I have an account
ar: عندي حساب

# emptyEmailMessage
source: Please enter your email address
ar: أدخل إيميلك

# enterValidEmail
source: please enter valid email address
ar: أدخل الإيميل الصحيح

# tellUsAboutYourProfile
source: Tell us a bit about yourself
ar: احكيلنا عن حالك

# profileDetailsQ1
source: Are you married?
ar: متزوج؟

# profileDetailsQ2
source: Are you a special need person?
ar: عندك أي احتياجات خاصة؟

# profileDetailsQ3
source: Are you employed?
ar: إنت صاحب عمل؟

# spouseNameCaps
source: SPOUSE NAME
ar: اسم الزوج/ الزوجة

# natureOfSpecialNeed
source: NATURE OF SPECIAL NEEDS
ar: طبيعة الاحتياجات الخاصة

# relationShipWithPepCaps
source: RELATIONSHIP WITH PEP
ar: علاقة مع PEP

# personName
source: PERSON’S NAME
ar: اسم الشخص

# personRole
source: PERSON’S ROLE
ar: وظيفته

source: REVIEW APPLICATION
ar: مراجعة الطلب

# confirmYourInformation
source: Review and confirm your details
ar: راجع وأكّد المعلومات

# emailAddressSmall
source: Email Address
ar: الإيميل

# residentCountrySmall
source: Resident Country
ar: الدولة

# homeAddressSmall
source: Home Address
ar: عنوان البيت

# streetAddressSmall
source: Street Address
ar: الشارع

source: Building Name / No
ar: اسم/ رقم العمارة

# natureSpecialNeeds
source: Nature of Special Needs
ar: طبيعة الاحتياجات الخاصة

source: Spouse Name
ar: اسم الزوج/ الزوجة

source: Relationship with PEP
ar: العلاقة مع PEP

source: Person’s Name
ar: اسم الشخص

source: Person’s Role
ar: وظيفته

# mainSourceIncome
source: Main Source of Income
ar: مصدر الدخل الرئيسي

# mainAnnualIncomeSmall
source: Main Annual Income
ar: الدخل السنوي الرئيسي

# monthlyIncomeSmall
source: Monthly Income
ar: الدخل الشهري

# annualIncomeSmall
source: Annual Income
ar: الدخل السنوي

# purposeOfAccount
source: Purpose of Account Opening
ar: سبب فتح الحساب

# employerNameSmall
source: Employer Name
ar: اسم المؤسسة

# employerCountrySmall
source: Employer Country
ar: دولة المؤسسة

# employerCitySmall
source: Employer City
ar: مدينة المؤسسة

# employerContactSmall
source: Employer Contact
ar: رقم هاتف المؤسسة

# additionalSourceIncome
source: Additional Source of Income
ar: الدخل الإضافي

# totalAdditionalIncomeSmall
source: Total Additional Income
ar: إجمالي الدخل الإضافي

# confirmInfoTC
source: I confirm that information provided is accurate and I hereby acknowledge that I have read, understood, and accepted Blink’s General
ar: أؤكد على أن المعلومات المزوّدة مني صحيحة وأقر بأنني قرأت وفهمت ووافقت على الشروط والأحكام العامة لـ Blink

# termsAndCondition
source: Terms and Conditions.
ar: الشروط والأحكام

# enterValidSpouseName
source: Please enter valid spouse name
ar: أدخل اسم الزوج/ الزوجة

# enterValidNature
source: Please select nature of special needs
ar: اختار طبيعة الاحتياجات الخاصة

# enterValidRelationshipWithPEP
source: Please enter valid relationship with PEP
ar: أدخل طبيعة العلاقة مع PEP

# enterValidEmployeeStatus
source: Please select valid employee status
ar: اختارالوظيفة

# enterValidPersonsName
source: Please enter valid person’s name
ar: أدخل اسم الشخص

# enterValidPersonsRole
source: Please enter valid person’s role
ar: أدخل وظيفته

source: UPLOAD DOCUMENTS
ar: تحميل الوثائق

# completeTaxReportInfo
source: Complete your tax report information below
ar: أكمل معلومات تقريرك الضريبي التالية:

source: Proof of Income
ar: إثبات الدخل

# proofOfIncomeDesc
source: For salaried individuals, please provide either one of Job Certificate / Salary Slip
ar: الرجاء تزويدنا بكتاب التعيين أو كشف الراتب

source: Proof of Address
ar: إثبات مكان السكن

# proofOfAddressDesc
source: Please provide your latest electricity bill to proof your address
ar: لإثبات مكان السكن، الرجاء تزويدنا بآخر فاتورة كهرباء او مياه

source: Upload
ar: تحميل

# confirmTermsCondError
source: Confirm to the terms and conditions.
ar: وافق الشروط والأحكام

source: Yes
ar: نعم

source: No
ar: لا

# enterPassword
source: Password field cannot be empty
ar: لازم تدخّل كلمة المرور

# enterConfirmPassword
source: Confirm password field cannot be empty
ar: لا يمكن أن يكون حقل تأكيد كلمة المرور فارغًا

# passwordMismatch
source: The passwords you entered do not match. Please try again.
ar: كلمة المرور غير صحيحة، حاول كمان مرة.

# retrieveConditionNotChecked
source: Please accept the above terms and conditions
ar: الرجاء الموافقة على الشروط والأحكام أعلاه

# emptyName
source: Name field cannot be empty
ar: لازم تدخّل الاسم

# emptyIdNumber
source: Id Number field cannot be empty
ar: لازم تدخّل رقم هويتك

# emptyDob
source: Date of birth field cannot be empty
ar: لازم تدخّل تاريخ ميلادك

# emptyNationality
source: Place Of Birth field cannot be empty
ar: لازم تدخّل مكان الولادة

# emptyExpiryDate
source: Expiry date field cannot be empty
ar: لازم تدخّل تاريخ الانتهاء

# emptyGender
source: Gender field cannot be empty
ar: لازم تدخّل الجنس

# emptyMotherName
source: Mother's name field cannot be empty
ar: لازم تدخّل اسم الأم

# emptyResidentCountry
source: Resident country field cannot be empty
ar: لازم تدخل دولة الإقامة

# emptyHomeAddress
source: Home address field cannot be empty
ar: لازم تدخل عنوان السكن

# emptyStreetAddress
source: Street address field cannot be empty
ar: لازم تدخل اسم الشارع

# emptyBuildingNameOrNo
source: Building name or number field cannot be empty
ar: لازم تدخل اسم/ رقم العمارة

source: Awesome!
ar: ممتاز!

# accountReady
source: Your account is up and ready. Let’s get your Blink Debit Card.
ar: حسابك صار جاهز! خلينا نجهّز بطاقة الدفع المباشر.

# refTitle
source: Ref No.
ar: رقم المرجع

source: IBAN
ar: الأيبان

# cardLater
source: I’ll get my card later
ar: رح آخذ بطاقتي بعدين

# cardPersonalization
source: to card personalization
ar: لتخصيص البطاقة

source: Storage
ar: تخزين

source: Camera
ar: كاميرا

source: Cancel
ar: إلغاء

# taxCountrySmall
source: Tax Country
ar: دولة الضريبة

# reasonOfUnavailabilitySmall
source: Reason of Unavailability
ar: سبب عدم التوفر

# invalidTaxCountry
source: Select tax country
ar: اختار دولة الضريبة

# invalidTinNumber
source: Enter correct tin number
ar: أدخل رقم تعريف ضريبي صحيح

# invalidReasonUnavailability
source: Select Reason of Unavailability
ar: اختار سبب عدم التوفر

# jobAndIncome
source: JOB & INCOME
ar: العمل والدخل

# tellUsHowDoMakeLiving
source: Bear with us, just a few more questions about your income
ar: تحمّلنا بشويّة أسئلة عن دخلك

source: MAIN ANNUAL INCOME
ar: الدخل السنوي الرئيسي

source: Do you have additional source of income
ar: عندك دخل إضافي

source: Add Income
ar: إضافة دخل

source: Search country
ar: ابحث

# noCountriesFound
source: No matching country found
ar: الدولة غير موجودة

# invalidTypesOfTransaction
source: Please Enter transaction type
ar: أدخل نوع الحركة

# invalidExpectedMonthlyTransaction
source: Enter expected monthly transaction
ar: أدخل الحركات الشهرية المتوقعة

# invalidExpectedAnnualTransaction
source: Enter expected annual transaction
ar: أدخل الحركات السنوية المتوقعة

source: ACCOUNT OPENING PURPOSE
ar: سبب فتح الحساب

# accountRelatedQuestions
source: Now, tell us what the account is for
ar: احكيلنا ليش بدك تفتح الحساب؟

source: TYPE OF TRANSACTIONS
ar: نوع الحركات

source: EXPECTED MONTHLY TRANSACTIONS
ar: الحركات الشهرية المتوقعة

source: EXPECTED ANNUAL TRANSACTIONS
ar: الحركات السنوية المتوقعة

source: Additional Income
ar: الدخل الإضافي

source: TOTAL ANNUAL INCOME
ar: إجمالي الدخل السنوي

# tellUsAboutImportantInformations
source: Next, please tell us about these important informations
ar: جاوبنا عن مجموعة من المعلومات المهمة

# areYouFirstDegreeRelativePEP
source: Are you or any first degree relatives a Political Exposed Person?
ar: إنت أو أي حدا من أقارب الدرجة الأولى عندكم علاقة بأحد السياسيين PEP؟

# invalidDeclarationSelection
source: Confirm to the terms and condition to proceed.
ar: وافق على الشروط والأحكام لتكمّل؟

# weNeedToMatchNamesONTaxReturn
source: We need to match the names on your tax return
ar: لازم نطابق الأسماء على إقرارك الضريبي

source: NAME AS PER INCOME TAX RETURN
ar: الاسم حسب الإقرار الضريبي

source: DATE OF BIRTH
ar: تاريخ الميلاد

source: COUNTRY OF CITIZENSHIP
ar: الدولة

source: or you can upload
ar: أو بتقدر تحمّل

source: W8 Form
ar: نموذج W8

# w8FormDesc
source: If you already have a physical pre-filled W8 form please upload below.
ar: إذا عندك نموذج W8 جاهز حمّله من هون

# uploadDocumentsSmall
source: Upload Document
ar: تحميل

# invalidDOB
source: Enter Date Of Birth
ar: أدخل تاريخ الميلاد

# invalidCitizenship
source: Enter citizenship
ar: أدخل دولة الجنسية

# pleaseProvideInformationIfAppliesToYou
source: Please provide information below, if applies to you
ar: أدخل المعلومات التالية إذا بتنطبق عليك

# permanentResidentAddressLine
source: Permanent residence address
ar: عنوان الإقامة الدائمة

source: STATE
ar: الولاية

source: CITY
ar: المدينة

source: COUNTRY
ar: الدولة

source: POST CODE
ar: الرمز البريدي

# mailingAddressDifferentFromResidence
source: Mailing address different from residence address?
ar: العنوان البريدي مختلف على عنوان الإقامة

# invalidPermanentAddress
source: Enter Permanent Residence Address
ar: أدخل عنوان الإقامة الدائمة

# invalidCountry
source: Select Country
ar: الدولة

# invalidState
source: Select State
ar: الولاية

# invalidCity
source: Select City
ar: المدينة

# invalidPostCode
source: Enter Post Code
ar: أدخل الرمز البريدي

source: BUSINESS NAME (OPTIONAL)
ar: الاسم التجاري

# isBusinessNameDifferent
source: Please enter if only the business name is different from the name above
ar: أدخل الاسم التجاري إذا كان مختلف عن اسمك

source: W9 Form
ar: نموذج W9

# w9FormDesc
source: If you already have a physical pre-filled W9 form please upload below.
ar: إذا عندك نموذج W9 جاهز حمّله من هون

source: ADDRESS IN UNITED STATES
ar: العنوان بأمريكا

# accountNumberOptional
source: LIST OF ACCOUNT NUMBER (OPTIONAL)
ar: قائمة أرقام الحسابات (اختياري)

# exemptPayeeOptional
source: EXEMPT PAYEE CODE (OPTIONAL)
ar: رمز الإعفاء الضريبي (اختياري)

source: Additional Requester
ar: مقدم طلب إضافي

# invalidAddress
source: Enter Address
ar: أدخل العنوان

# requesterName
source: requester’s name
ar: اسم مقدم الطلب

source: WHICH TAX PAYER ARE YOU?
ar: شو نوع ضريبتك؟

source: I confirm that my
ar: أوكد على

source: FATCA
ar: قانون الامتثال الضريبي للحسابات الأجنبية

source: declaration is true and correct.
ar: التصريح سليم وصحيح

# termAndCondition
source: Terms and Conditions
ar: الشروط والأحكام

source: of the bank.
ar: من البنك

# invalidTaxPayer
source: Select Tax Payer
ar: اختار نوع الملف الضريبي

# invalidSocialSecurityNumber
source: Enter social security number
ar: أدخل رقم الضمان الاجتماعي

# whichTaxPayerAreYouSmall
source: Which Tax Payer Are You?
ar: شو نوع الملف الضريبي؟

# wantToClaimTaxTreatyBenefits
source: Do you want to Claim of Tax Treaty Benefits?
ar: بدك تطالب بمزايا اتفاق الضريبة؟

# invalidIdentificationNumber
source: Enter identification number
ar: أدخل رقم التعريف

# invalidIncomeType
source: Enter income type
ar: أدخل نوع الدخل

# invalidExplanation
source: These field cannot be empty
ar: لازم ما تترك هاي الخانة فاضية

# beneficialOwnerIsAResidenceOf
source: Beneficial owner is a resident of
ar: صاحب الحساب المنتفع مقيم في

# usIDNumber
source: U.S. tax payer identification number
ar: رقم تعريف دافع الضريبة في أمريكا

source: Type of Income
ar: نوع الدخل

source: EXPLANATION
ar: توضيح

# invalidPreferredDate
source: Select date
ar: تاريخ

# invalidPreferredTime
source: Select time
ar: اختار الوقت

# pleaseSelectPreferredAgentForVideoCall
source: Schedule your call for later
ar: حدد موعد لاحق لمكالمتك

source: PREFERRED DATE
ar: التاريخ المفضل

source: PREFERRED TIME
ar: الوقت المفضل

# invalidExplanationForUnavailability
source: Enter reason for unavailability
ar: أدخل سبب عدم التوفر

# passwordDialogHeader
source: Create Password
ar: أنشئ كلمة مرور

# passwordDialogContent
source: Passwords must contain 8 minimum characters, 1 uppercase letter and 1 symbol.
ar: كلمة المرور لازم تتكون من 8 خانات على الأقل، حرف كبير ورمز.

source: Swipe up to register
ar: اسحب الشاشة لفوق للتسجيل

source: Error
ar: خطأ

source: Let’s create your account
ar: خلينا نفتح حسابك

source: Swipe down to login
ar: اسحب الشاشة لتحت لتسجيل الدخول

source: Register via Email
ar: التسجيل من خلال الإيميل

# motherName
source: MOTHER’S NAME
ar: اسم الأم

# motherNameHint
source: Please enter mother's name
ar: أدخل اسم الأم

# openAccount
source: Open an Account
ar: افتح حساب

# productSelectorHeader
source: Great! Now, here’s what Neu has to offer for you
ar: ممتاز! تعرّف على عروض Blink

# acceptedWorldWide
source: Accepted worldwide with no hidden charges
ar: مقبولة عالمياً بدون رسوم مخفية

# loyaltyRewards
source: Enjoy loyalty rewards with great multiplier
ar: استمتع بنقاط مكافآت أكتر

# customerService
source: 24/7 Customer Service Service
ar: خدمة زبائن 24/7

# videoCallInfoHeader
source: It’s time for a quick video call
ar: صار وقت مكالمة مرئية (فيديو) للتحقق من شخصيتك

# brightPlace
source: Make sure you’re in bright place and surrounding
ar: تأكد من إضاءة المكان اللي إنت فيه

# quietSurrounding
source: Best if your surrounding is quiet and private
ar: يا ريت تكون بمكان هادي وفيه خصوصية

# preferredAgent
source: You may select your preferred agent to chat with
ar: بتقدر تختار الموظف المفضل إلك لتحكي معه

# scheduleLater
source: Schedule for later
ar: تحديد موعد لاحق

# agentSelectionHeader
source: Please select your preferred agent for a video call
ar: اختار الموظف المفضل إلك لتحكي معه

source: Male Agent
ar: موظف ذكر

source: Any Agent
ar: أي موظف

source: Female Agent
ar: موظفة

source: Edit Information
ar: تعديل المعلومات

source: Name as per ID
ar: الاسم حسب الهوية

source: ID Number
ar: رقم الهوية

# dateOfBirthSmall
source: Date of Birth
ar: تاريخ الميلاد

# nationalitySmall
source: Nationality
ar: الجنسية

# expiryDateSmall
source: Expiry Date
ar: تاريخ الانتهاء

# genderSmall
source: Gender
ar: الجنس

source: Mother’s Name
ar: اسم الأم

source: Mother’s Birthplace
ar: مكان ولادة الأم

source: Add. Income 1
ar: إضافة دخل 1

source: Add. Income 2
ar: إضافة دخل 2

# typeOfTransactionsSmall
source: Type of Transactions {noOfTransaction}
ar: نوع الحركة {noOfTransaction}

# expMonthlyTransactions
source: Expected Monthly Transactions
ar: الحركات الشهرية المتوقعة

# expAnnualTransactions
source: Expected Annual Transactions
ar: الحركات السنوية المتوقعة

source: Are you U.S. Citizen?
ar: إنت مواطن أمريكي؟

# areYouTaxResidentQ
source: Are you Tax Resident in any other country than U.S. or Jordan?
ar: بتدفع ضريبة بأي دولة غير الأردن وأمريكا

# areYouAnyFirstDegreeQ
source: Are you or any first degree relatives a Political Exposed Person?
ar: إنت أو أي حدا من أقارب الدرجة الأولى عندكم علاقة بأحد السياسيين PEP؟

source: JOB & INCOME
ar: العمل والدخل

# jobIncomeMsg
source: Bear with us, just a few more questions about your income
ar: تحمّلنا بشويّة أسئلة عن دخلك

# additionalSourceIncomeQ1
source: Do you have additional source of income
ar: عندك دخل إضافي

# stateSmall
source: State
ar: الولاية

# citySmall
source: City
ar: المدينة

source: Search state
ar: البحث عن ولاية

source: Search city
ar: البحث عن مدينة

# whatYourEmailAndMobileNumber
source: What’s your email and mobile number?
ar: شو إيميلك ورقم موبايلك؟

# pleaseConfirmYourIDDetailsBelow
source: Now let's confirm your ID details
ar: خلينا نأكد على معلوماتك

source: Where do you currently live?
ar: وين ساكن حالياً؟

# accountOpeningDescription
source: Account opening is only available for Jordanians for now, but don’t worry we’re expanding into new countries, soon!
ar: فتح الحساب متوفر فقط للأردنيين حالياً. ما تقلق رح نتوسع قريباً لدول أخرى!

# notifyMeExC
source: Notify me
ar: ذكرني

source: Back to Card Settings
ar: العودة لإعدادات البطاقة

source: Back to Login
ar: العودة إلى تسجيل الدخول

source: NOTIFY ME
ar: ذكرني

# pleaseEnterLatestEmail
source: Please enter your latest email. You’ll hear from us, soon!
ar: أدخل أحدث إيميل عندك. رح نتواصل معك قريباً!

# thankYouForInterestWillSendUpdate
source: Thank you for your interest! We’ll send an update to your email once the access is available.
ar: شكراً على اهتمامك! رح نبعثلك ايميل بمجرد توفره

source: to Welcome Page
ar: إلى الصفحة الرئيسية

# invalidRelationship
source: Select relationship
ar: اختار العلاقة

# invalidName
source: Enter name
ar: أدخل الاسم

# invalidRole
source: Enter role
ar: أدخل الوظيفة

# emptyIncomeDocument
source: Please upload income document
ar: حمّل وثيقة الدخل

# emptyAddressDocument
source: Please upload address document
ar: حمّل وثيقة العنوان

# pleaseUploadNecessaryInfo
source: You’re done! Just upload your documents
ar: خلصنا! ما ضل إلا تحمّل الوثائق

source: Search year
ar: البحث عن سنة

source: No matching year found!
ar: لم يتم العثور على السنة

# areYouBeneficialOwnerAccount
source: Are you the beneficial owner of the account?
ar: إنت المستفيد من الحساب؟

source: Type of expected transactions
ar: نوع الحركات المتوقعة

source: Social Security Card
ar: بطاقة الضمان الاجتماعي

# socialSecurityCardDesc
source: We need the copy of your physical Social Security Card
ar: بنحتاج منك صورة عن بطاقة الضمان الاجتماعي

# scanIDAgain
source: Something wrong, scan ID again
ar: في خطأ بالمعلومات؟ صوّر هويتك كمان مرة

# confirmDetailsConfirmation
source: I confirm and agree that all my ID details are correct
ar: أؤكد وأوافق على صحة جميع معلومات هويتي الشخصية

source: Permanent address
ar: العنوان الدائم

source: JOB NAME
ar: الوظيفة

# invalidJobName
source: Enter job name
ar: أدخل الوظيفة

# eightCharacters
source: 8 characters
ar: 8 خانات

# oneUpperCaseLetter
source: 1 uppercase letter
ar: 1 حرف كبير

# oneNumber
source: 1 number
ar: رقم

# oneSymbol
source: 1 symbol
ar: رمز

source: What is your employment status?
ar: شو وضعك الوظيفي؟

# emptyDocument
source: Upload valid document
ar: حمّل وثيقة صالحة
