Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

# startOverDesc
source: Quick edit is disabled for some informations. Would you like to start over? Don’t worry, we keep your filled informations.
ar: التعديل السريع غير فعال لبعض المعلومات. بدك تعيد من الأول؟ ما تقلق، رح نحتفظ بمعلوماتك الموجودة.

source: Start over
ar: ابدأ من جديد

source: Permanent Home Address
ar: عنوان السكن الدائم

# connectToAgentToAssistYou
source: Connecting to our agent to assist you
ar: التواصل مع أحد موظفينا للمساعدة

source: Looking for available agent..
ar: البحث عن موظف متاح

# estimatedTime
source: Estimated wait time {estimatedTime}
ar: وقت الانتظار المتوقع {estimatedTime}

# thankYouForWaitingCallWillStartAutomatically
source: Thank you for waiting, the video call will start automatically
ar: شكرا للانتظار، المكالمة رح تبدأ تلقائياً

# uploadDocumentLater
source: Upload documents later
ar: حمّل الوثائق لاحقاً

# uploadDocumentLaterQues
source: Upload Document Later?
ar: حمّل الوثيقة لاحقاً

# uploadDocLaterDesc
source: You will need to upload required document from Profile Settings later in order to complete your account verification. Note: Account will be closed automatically for any incomplete document
ar: رح تحتاج تحمّل الوثيقة المطلوبة من "الإعدادات الشخصية" لاحقاً لإكمال عملية التحقق من حسابك. ملاحظة: رح يتم إغلاق الحساب تلقائياً بسبب أي وثيقة غير مكتملة

# uploadDocumentDesc1
source: within 10 days after date opened.
ar: خلال 10 أيام بعد تاريخ فتح الحساب

source: Hello,
ar: مرحباً

source: WELCOME
ar: أهلاً فيك

# successfullyCreatedLoginAccount
source: You have successfully created your profile, now let's get your account up and running.
ar: تم إنشاء ملفك الشخصي بنجاح. خلينا نفتح حسابك ونشغله

# saveEarningsDigitally
source: Save your earnings digitally and securely
ar: احفظ أرباحك رقمياً وبأمان

# sendMoneyToFriendAndFamily
source: Send money to your friends and family
ar: حوّل الأموال لأصحابك وعيلتك

source: Open Account Now
ar: افتح حساب هلأ

source: Log out and continue later
ar: تسجيل الخروج والاستمرار لاحقاً

source: Terms & Conditions
ar: الشروط والأحكام

# emptyCity
source: Enter City
ar: أدخل المدينة

# invalidBeneficialOwnerAccount
source: We're sorry, you must be the beneficial owner of the account to proceed.
ar: عفوا، للاستمرار لازم تكون إنت المالك المستفيد من الحساب

# preferredTimeSmall
source: Preferred Time
ar: الوقت المفضل

source: Business Type
ar: نوع العمل

source: PLEASE SPECIFY
ar: الرجاء التحديد

# invalidBusinessType
source: Select Business Type
ar: اختار نوع العمل

# emptyBusiness
source: Specify Business
ar: حدد العمل

source: What is P.E.P?
ar: شو يعني PEP؟

source: Do you have any other nationality?
ar: عندك جنسية ثانية؟

source: Other Nationality
ar: جنسية ثانية

source: Politically Exposed Person
ar: PEP

# pepDesc
source: is an individual who currently has or previously had a high profile political role, such as: head of government/state, minister, judicial or military official, high-ranking government or public official, a prominent politician, a prominent figure in a political party, a senior executive of a state-owned company; including the individual’s first-degree relatives, their business partners, or any persons working on their behalf or having authorization/power of attorney issued by them.
ar: الاشخاص السياسيون ممثلو المخاطر الأجانب (Foreign Politically Exposed Persons) :هم الأشخاص الذين يشغلون أو شغلوا وظيفة عامة عليا في دولـة أجنبيـة، مثل: رئيس دولة أو حكومة أو المسؤولين القضائيين أو العسكريين، أو منصب حكومي رفيع المستوى أو كان سياسي بارز أو شخصية بارزة في حزب سياسي أو كبار التنفيذيين في الشركات المملوكة لدولة أجنبية ويشمل ذلك أقارب هؤلاء الاشخاص من الدرجة الأولى كحد أدنى أو شركائهم في العمل أو أي أشخاص يعملون بالنيابة عنهم أو يملكون تفاويض صادرة عنهم الاشخاص السياسيون ممثلو المخاطر المحليون (Local Politically Exposed Persons) الأشخاص الذين يشغلون أو شغلوا وظيفة عامة عليا في المملكة، مثل: رئيس حكومة أو وزير أو المسؤولين القضائيين أو العسكريين أو منصب حكومي رفيع المستوى أو كان سياسي بارز أو شخصية بارزة في حزب سياسي أو كبار التنفيذيين في الشركات المملوكة للدولة ويشمل ذلك أقارب هؤلاء الاشخاص من الدرجة الأولى كحد أدنى أو شركائهم في العمل أو أي أشخاص يعملون بالنيابة عنهم أو يملكون تفاويض صادرة عنهم.

# verifyInformationDirectlyOrUsingThirdPartyAgentDesc
source: I authorize Blink to disclose any information related to my accounts to the US Tax Department or any related party.
ar: أفوض Blink بالإفصاح عن أي معلومات تتعلق بحساباتي لإدارة الضرائب الأمريكية أو أي طرف ذي علاقة.

source: Enable Biometric Login
ar: تفعيل تسجيل الدخول بالبصمة

# biometricLoginDesc
source: To Blink in more seamlessly, please enable biometric login
ar: لاستخدام Blink بسلاسة أكثر، فعّل خاصية التسجيل بالبصمة

source: Maybe later
ar: خليها لبعدين

source: Allow biometric
ar: تفعيل الدخول بالبصمة

# nationalId
source: NATIONAL ID NUMBER
ar: الرقم الوطني

source: Place of birth
ar: مكان الولادة

source: LEGAL DOCUMENT NO.
ar: رقم الوثيقة القانونية

source: Issuing date
ar: تاريخ الإصدار

source: Issuing place
ar: مكان الإصدار

# invalidDocumentNo
source: Enter Legal Document No.
ar: الوثيقة غير صالحة. امسح الوثيقة كمان مرة او تواصل معنا على 5200100-06 لتعرف أكتر.

# invalidIssuingDate
source: Select Issuing Date
ar: اختار تاريخ الإصدار

# invalidIssuingPlace
source: Enter Issuing Place
ar: أدخل مكان الإصدار

# scrollToSetDate
source: Scroll to set {scrollToSetDate}
ar: اختار التاريخ {scrollToSetDate}

source: Confirm
ar: تم

source: STREET NAME
ar: اسم الشارع

source: District
ar: المنطقة

# emptyDistrict
source: Enter district
ar: أدخل المنطقة

source: Take Photo
ar: التقاط صورة

source: Upload Document
ar: تحميل الوثيقة

source: Please select your action
ar: شو بدك تعمل؟

source: Additional Nationality Passport
ar: جواز سفر إضافي لجنسية أخرى

# additionalNationalityPassportDesc
source: Please provide your additional nationality passport as a proof
ar: الرجاء تزويدنا بجواز سفر جنسيتك الأخرى كإثبات

# enterLoginDetails
source: Enter your login details
ar: أدخل معلومات تسجيل الدخول

source: Forgot password?
ar: نسيت كلمة المرور؟

# accountCreated
source: Account has been created successfully.
ar: تم إنشاء الحساب بنجاح

# cardDelivery
source: to Card Delivery
ar: إلى توصيل البطاقة

# errorSavingIdCard
source: Error While saving IDCard
ar: خطأ خلال حفظ الهوية

# idCardExpired
source: Your ID is expired. Please try again after renewing your ID.
ar: هويتك منتهية الصلاحية. حاول بعدين لما تجددها.

source: Device Not Found
ar: الجهاز غير موجود

# getLater
source: I’ll get it later
ar: رح آخذها بعدين

# getCardNow
source: Get your card now
ar: احصل على بطاقتك هلأ

source: Total Balance
ar: الرصيد الإجمالي

source: My Account
ar: حسابي

source: AVAILABLE BALANCE
ar: الرصيد المتوفر

source: ACCOUNT NO.
ar: رقم الحساب

source: Add money
ar: إضافة أموال

# myDebitCard
source: My Visa Debit Card
ar: بطاقة الدفع المباشر

source: Flip card
ar: اقلب البطاقة

source: Card delivered?
ar: وصلتك البطاقة؟

# lookingFor
source: What are you looking for?
ar: البحث عن حوالة

source: Debit Card delivered
ar: وصلت بطاقة الدفع المباشر

# joinedBlink
source: You joined Blink
ar: صار عندك مع Blink

source: Debit Card activated.
ar: تم تفعيل بطاقة الدفع المباشر

source: Credit Card activated.
ar: تم تفعيل البطاقة الائتمانية

# blinkBorn
source: Blink was born
ar: تاريخ تأسيس بلينك

# visaPlatinumCard
source: ViSA Platinum Credit Card
ar: بطاقة فيزا الائتمانية البلاتينية

# numberOnCard
source: NUMBERS ON CARD
ar: الأرقام على البطاقة

# cardHasBeenDelivered
source: Check that the numbers on the back of your card match the numbers above.
ar: تأكد من إنه الأرقام اللي على ظهر البطاقة هي نفسها الأرقام اللي فوق

source: Swipe to confirm
ar: اسحب الشاشة للتأكيد

# deliveryIssue
source: I have delivery issue
ar: عندي مشكلة بالتوصيل

# creditCardVerified
source: Credit card has been verified.
ar: تم التحقق من البطاقة الائتمانية

# physicalCardUse
source: You can use your physical card to pay and shop anywhere. Contactless limit is now 300 JOD.
ar: بتقدر تستخدم بطاقتك الفعلية لتدفع وتشتري بأي مكان. السقف الاعلى للدفع بدون لمس هو 300 دينار.

# debitCardVerified
source: Debit card has been verified.
ar: تم التحقق من بطاقة الدفع المباشر.

# blinkCreditCard
source: Never postpone a purchase again! Instantly issue your free virtual Rebellious Red credit card.
ar: ما تأجل مشترياتك! أصدر بطاقتك الائتمانية الافتراضية Rebellious Red فورا ومجانا"

source: TOTAL USED LIMIT
ar: السقف الإجمالي المستغل

source: Pay back
ar: سداد

source: AVAILABLE AMOUNT
ar: المبلغ المتوفر

source: Flip back
ar: اقلب للخلف

source: CARD NUMBER
ar: رقم البطاقة

source: LINKED ACCOUNT NUMBER
ar: رقم الحساب المرتبط

source: Send Money
ar: تحويل أموال

source: Request money
ar: طلب أموال

# addSendContact
source: You don't have any contacts yet. Your Blink contacts can be saved while sending money.
ar: ما عندك معارف لسه. رح يتم حفظ المعارف على Blink لما تحوّللهم الأموال.

source: Payments
ar: دفعات

source: See all contacts
ar: كل الأصدقاء

source: Back to Payments
ar: العودة

source: Send money to
ar: إرسال أموال إلى

source: Transaction Purpose
ar: سبب الحركة

source: Edit
ar: تعديل

source: Account balance
ar: رصيد الحساب

source: Sent to
ar: إرسال إلى

source: Ref No.
ar: رقم المرجع

source: Date
ar: التاريخ

source: You cannot send money to your own account.
ar: عفوا! ما بتقدر تحول لنفس حسابك

source: Share my receipt
ar: مشاركة الوصل

source: Undo transaction
ar: التراجع عن الحركة

source: Request money from
ar: طلب أموال من

source: Requested from
ar: تم الطلب من

# youWillBeNotified
source: You will be notified once your request is accepted and money is added into your account.
ar: رح نذكرك بمجرد الموافقة على طلبك ورح يتم إضافة المبلغ لحسابك

source: Undo request
ar: التراجع عن الطلب

source: PURPOSE DETAILS
ar: تفاصيل التحويل

source: Edit Transaction Purpose
ar: تعديل تفاصيل التحويل

# tapToEdit
source: Tap to edit amount
ar: اضغط لتعديل المبلغ

source: Sending
ar: جاري الإرسال

# ibanOrMobile
source: IBAN / Mobile No. / ALIAS
ar: الأيبان/ رقم موبايل/ اسم مستعار

# ibanOrMobileRequest
source: Mobile No. / ALIAS
ar: رقم موبايل/ اسم مستعار

source: Select purpose
ar: اختار السبب

# addRecipientToContact
source: Add this recipient to your Blink contacts
ar: إضافة إلى قائمة أصدقائي

# enterCode
source: Enter the 6-digit code sent to
ar: أدخل الرمز المكون من 6 خانات

source: Requesting
ar: طلب

# waysYocCanAddMoneyToAccount
source: Ways to add money into your account
ar: طرق إضافة أموال لحسابك

# requestMoneyFromOtherBank
source: Request money from another bank account
ar: طلب أموال من حساب في بنك آخر

# requestMoneyFromOtherBankDesc
source: If you currently have money in another bank account, you can easily send a money request to transfer money into your Blink account
ar: إذا كان معك أموال بحساب في بنك آخر، بتقدر تطلب تحويله بسهولة لحسابك على Blink

source: Receive money from others
ar: استقبال الأموال من الآخرين

# receiveMoneyFromOthersDesc
source: Share your account info to be able to receive money.
ar: شارك معلومات حسابك لتقدر تستقبل الأموال

source: Deposit via ATM
ar: إيداع في صراف آلي

# depositViaATMDesc
source: Deposit cash directly into your Blink account through any Capital Bank ATM, with or without your card.
ar: إيداع مباشر بحسابك على Blink من خلال صرافات كابيتال بنك، مع أو بدون بطاقة.

source: Share account info
ar: شارك معلومات حسابك

source: Locate ATM
ar: موقع الصراف الآلي

source: Get My Credit Card
ar: الحصول على بطاقتي الائتمانية

source: or
ar: أو

source: Swipe to view list
ar: اسحب الشاشة لاستعراض القائمة

source: Swipe to view map
ar: اسحب الشاشة لاستعراض الخريطة

source: Get Directions
ar: الحصول على العنوان

# dragMap
source: Drag & move the map to adjust the location
ar: اسحب وحرك الخريطة لتضبط الموقع

# bornBlink
source: Born blink. Be Blink.
ar: تاريخ تأسيس بلينك

# spendJod
source: Spend 1 JOD and stand a chance to win 1,000 JOD daily.
ar: اصرف 1 دينار واحصل على فرصة ربح 1000 دينار يومياً

source: Find out more
ar: اعرف أكتر

# invalidUserNamePassword
source: You have entered an invalid username or password. Please try again.
ar: خطأ في اسم المستخدم أو كلمة المرور. حاول مرة ثانية.

# errorSavingStatus
source: Error While Saving Status
ar: خطأ خلال الحفظ

# emptyNationalityDocument
source: Upload valid nationality document.
ar: حمّل إثبات هوية صحيحة.

# errorUploadImage
source: Error While Upload Image
ar: خطأ خلال تحميل الصورة

# invalidOtp
source: The code you entered is incorrect, please try again.
ar: الكود غير صحيح. حاول مرة ثانية.

# otpExpired
source: Your OTP code is expired, please request for a new OTP code
ar: انتهت صلاحية كلمة المرور لمرة واحدة OTP. اطلب كلمة جديدة.

# emailAlreadyExist
source: The email you have entered already exists, please enter another email or try to login using this email if you have already tried to register previously.
ar: الإيميل مستخدم من قبل، الرجاء إدخال إيميل جديد أو حاول تسجّل دخولك من خلال هاد الإيميل.

# idCardNotAllowed
source: ID card is not allowed for Blink.
ar: هاي الهوية غير صالحة لـ Blink

# otpLimitExceed
source: Otp Limit Exceeds, Please Try again Later
ar: تجاوزت الحد الاعلى لكلمة مرور OTP. حاول بعدين.

# errorCreatingAccount
source: An error occurred while opening your account. Please try again later or contact our Engagement Team on 06-5200100.
ar: خطأ خلال فتح حسابك. حاول كمان مرة أو تواصل معنا على 06-5200100

source: Permanent Country
ar: دولة الإقامة الدائمة

source: Permanent City
ar: مدينة الإقامة الدائمة

# additionalIncomeList
source: Add. Income {additionalIncomeList}
ar: إضافة دخل {additionalIncomeList}

# unableToVerifyIDCard
source: Dear Customer, we were unable to verify your ID card number. Kindly scan the card again or contact our customer service at 7777-7777.
ar: عملينا العزيز، ما قدرنا نتحقق من رقم هويتك الشخصية. حاول امسح الهوية كمان مرة أو تواصل مع مركز خدمات الزبائن على 06-5200100

# invalidUser
source: You have entered an invalid username. Please try again.
ar: خطأ في اسم المستخدم. حاول مرة ثانية.

source: Error While Logout
ar: خطأ خلال تسجيل الخروج

# mobileNoExist
source: Mobile Number Exist
ar: رقم الموبايل تم استخدامه سابقا"ً

# userNotRegister
source: User is not registered. Please register and call our Engagement Team if needed on 06-5200100.
ar: اسم المستخدم غير مسجّل. الرجاء التسجيل والاتصال معنا عند الحاجة على 5200100-06

# errorWhileRegistration
source: An error has occurred during Registration Process, please try again
ar: خطأ خلال عملية التسجيل، حاول مرة ثانية.

# errorWhileGetAdditionalDocument
source: Error while Get Additional Documentation
ar: خطأ خلال الحصول على الوثائق الإضافية

# youLocked
source: Oops! Your account is locked. Please contact our Engagement Team on 06-5200100 to unlock.
ar: عفواً! تم قفل حسابك. الرجاء التواصل معنا على 5200100-06 لفك القفل.

# accountLocked
source: Oops! Your account is locked. Please contact our Engagement Team on 06-5200100 to unlock.
ar: عفواً! تم قفل حسابك. الرجاء التواصل معنا على 5200100-06 لفك القفل.

# pleaseProvideSelfie
source: Please provide selfie to proceed further.
ar: صوّر حالك سيلفي للاستمرار.

# enableBiometricLoginTitle
source: Enable Biometric Login
ar: تفعيل تسجيل الدخول بالبصمة

# enableBiometricLoginDescriptionAndroid
source: Scan your finger/face to log in
ar: مسح بصمة اصبعك او وجهك لتسجيل الدخول

# enableBiometricLoginDescriptionIos
source: Scan your face to log in
ar: سجّل دخول من خلال بصمة الوجه

source: Swipe up to join our community
ar: اسحب لفوق لتنضم إلنا

source: Let’s Create Your Profile
ar: خلينا نعمل ملفك الشخصي

# enterYourEmailAndMobile
source: Enter your email and mobile number
ar: أدخل إيميلك ورقم موبايلك

source: Enable
ar: تفعيل

# informationSave
source: Don't worry, if you log out your information will be saved and you can login at any time.
ar: ما تقلق، إذا عملت تسجيل خروج رح تضل معلوماتك محفوظة للمرة الجاي.

source: Upload ID instead
ar: أو حمّل صورة هويتك

source: AREA
ar: المنطقة

source: INCOME DETAILS
ar: معلومات الدخل

source: ACCOUNT DETAILS
ar: معلومات الحساب

source: MAILING address Line
ar: العنوان البريدي

source: Enter mailing address
ar: أدخل عنوانك البريدي

# whatIsTaxTreatyBenefits
source: What is Claim of Tax Treaty Benefits?
ar: شو يعني المطالبة بمزايا الاتفاق الضريبي؟

source: REFERENCE NUMBER
ar: رقم المرجع

# invalidReferenceNumber
source: Enter reference number
ar: أدخل رقم المرجع

# provisionClaim
source: provisions CLAIM of Article & paragraph
ar: مادة وفقرة أحكام المطالبة

# treatyClaimRate
source: treaty identified to Claim Rate (%)
ar: معدل مطالبة الاتفاق الضريبي (%)

# invalidProvisionClaim
source: Enter provision claim article and paragraph
ar: أدخل مادة وفقرة أحكام المطالبة

# invalidTreatyClaimRate
source: Enter treaty identified to claim rate
ar: أدخل نوع الاتفاق الضريبي للمطالبة بالنسبة

# consentForSignatureUpload
source: We need your consent by uploading the signature
ar: حمّل توقيعك للموافقة والاستمرار

# emptySignature
source: Please upload signature
ar: حمّل توقيعك

source: Your Signature
ar: توقيعك

# signatureUploadDes
source: Simply sign on a plain white paper and upload it as a declaration of your FATCA information
ar: وقّع على ورقة بيضاء وحمّل التوقيع كإفصاح عن معلوماتك حسب قانون الامتثال الضريبي للحسابات الأجنبية

source: Upload Signature
ar: تحميل التوقيع

source: OTHER DETAILS
ar: معلومات أخرى

# iConfirmThatAllInfoAccurateFatca
source: I confirm that all information provided is accurate.
ar: أؤكد على أن جميع المعلومات المزودة دقيقة.

# fewMoreQuestions
source: Almost there, just a few more questions
ar: قربنا نخلص، تحمّلنا بشوية أسئلة

source: VIDEO CALL
ar: مكالمة فيديو

# videoCallInfoDescription
source: Please get ready to meet our Engagement Team, we will now connect you.
ar: خليك جاهز لمكالمة سريعة مع فريقنا، رح نتواصل معك هلأ.

source: We will connect you in Blink...
ar: رح نتواصل معك خلال لحظات

source: FATCA Certification
ar: شهادة الامتثال الضريبي للحسابات الأجنبية

source: Exempt Payee Code
ar: رمز الإعفاء الضريبي

source: Exemption from FATCA Reporting Code
ar: الإعفاء من قانون الإبلاغ عن الامتثال الضريبي للحسابات الأجنبية

source: U.S. Tax Payer Identification Number
ar: رقم هوية دافع الضرائب الأمريكي

# referenceNumberSmall
source: Reference Number
ar: رقم المرجع

source: Claim of Tax Treaty Benefits
ar: المطالبة بمزايا الاتفاق الضريبي

# genericError
source: Something went wrong. Please try again.
ar: صار خطأ. حاول كمان مرة.

# invalidUserName
source: Please enter a valid UserName
ar: أدخل اسم مستخدم صحيح

# clickToEditSomeMayBeDisabled
source: Click to edit the fields, some may be disabled.
ar: اضغط لتعديل الخانات، ممكن يتم تعطيل بعضها.

# areaSmall
source: Area
ar: المنطقة

source: Occupation/Business Type
ar: نوع العمل/ الوظيفة

# employerPhoneNo
source: Employer Phone Number
ar: رقم المؤسسة

source: Other Income
ar: دخل آخر

source: Expected Transactions
ar: الحركات المتوقعة

source: Expected Monthly Amount
ar: قيمة الحركات الشهرية المتوقعة

source: Expected Annual Amount
ar: قيمة الحركات السنوية المتوقعة

source: DEBIT CARD
ar: بطاقة الدفع المباشر

# yourCardHasBeenIssued
source: Your Yellow Sun debit card has been issued!
ar: تم إصدار بطاقة الدفع المباشر Yellow Sun

# letsSet4DigitPin
source: Let’s set your 4-digit PIN
ar: خلينا نعمل الرمز السري PIN مكون من 4 أرقام

# nowConfirmPin
source: Now, confirm your PIN
ar: هلأ أكّد الرمز السري PIN

# yourCardReady
source: Your card is ready!
ar: بطاقتك صارت جاهزة

# yourCardReadyDesc
source: Aramex will contact you soon to deliver your physical card. In the meantime, you can start using your virtual card immediately.
ar: رح يتواصلوا معك من أرامكس قريباً، حالياً بتقدر تستخدم بطاقتك الافتراضية فوراً.

source: Error While get Account
ar: خطأ خلال فتح الحساب

# emptyPin
source: Enter Pin
ar: أدخل الرمز السري PIN

# invalidPinLength
source: Length of pin cannot be less than 4
ar: الحد الأدنى للرمز السري PIN هو 4 أرقام

source: Pin does not match
ar: رقم PIN غير مطابق

source: to Dashboard
ar: إلى شاشة التحكم

# accountInquiryWentWrong
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-010)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-010)

# accountInquiryWentWrong61
source: An error occurred while trying to get your account information. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: خطأ خلال الحصول على معلومات حسابك. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06

source: CHANGE EMAIL ADDRESS
ar: تغيير الإيميل

# enterNewEmailAddress
source: Please enter your new email
ar: أدخل إيميلك الجديد

source: Settings
ar: الإعدادات

source: Tap to edit photo
ar: اضغط لتعديل الصورة

source: Change Password
ar: تغيير كلمة المرور

source: Biometric Login
ar: التسجيل بالبصمة

source: My Documents
ar: الوثائق

# termsAndConditionsSetting
source: Terms & Conditions
ar: الشروط والأحكام

source: CHANGE MOBILE NUMBER
ar: تغيير رقم الموبايل

# enterNewMobileNo
source: Please enter your new mobile number
ar: أدخل رقم موبايلك الجديد

source: Select from Library
ar: اختار من المكتبة

source: Remove Photo
ar: حذف الصورة

source: SUCCESS
ar: نجاح

# mobileNumberUpdated
source: Your mobile number has been updated successfully
ar: تم تحديث رقم موبايلك بنجاح

# emailAddressUpdated
source: Your email address has been updated successfully
ar: تم تحديث إيميلك بنجاح

# profilePhotoUpdated
source: Your profile picture has been updated successfully
ar: تم تحديث صورتك بنجاح

# emptyNewPassword
source: Enter New Password
ar: أدخل كلمة المرور الجديدة

# createYourLoginPassword
source: Please enter your new password
ar: أدخل كلمة المرور الجديدة

source: CURRENT PASSWORD
ar: كلمة المرور الحالية

source: NEW PASSWORD
ar: كلمة المرور الجديدة

# passwordUpdatedSuccessfully
source: Your password has been updated successfully
ar: تم تحديث كلمة المرور بنجاح

# biometricLoginActivated
source: Your biometric login has been activated successfully
ar: تم تفعيل الدخول بالبصمة بنجاح

# proofOfIncomeDescSetting
source: If you receive a salary, upload your job certificate or your salary slip
ar: حمّل صورة عن شهادة أو كشف راتبك

# proofOfAddressDescSetting
source: To confirm your address, upload your latest utility bills
ar: لتأكيد عنوانك، حمّل آخر فاتورة مياه أو كهرباء

# invalidIDCard
source: ID Card is not valid. Please scan JORDANIAN ID Card.
ar: هويتك الشخصية غير صالحة. الرجاء مسح هوية شخصية أردنية.

source: Manage Contacts
ar: أصدقائي

source: Search contacts
ar: ابحث عن صديق

# addingContactsDesc
source: You will be able to add contacts to your list soon.
ar: رح تقدر تضيف المعارف لقائمتك قريباً.

source: Nickname
ar: الاسم المستعار

source: IBAN / Mobile No. / ALIAS
ar: الأيبان/ رقم موبايل/ اسم مستعار

source: BANK NAME
ar: اسم البنك

source: PURPOSE
ar: السبب

# purposeDetail
source: PURPOSE DETAILS
ar: تفاصيل السبب

# removeFromContact
source: Remove contact
ar: حذف جهة الاتصال

source: account holder name
ar: اسم صاحب الحساب

# yourContactDetailsUpdated
source: Your contact details have been saved.
ar: تم حفظ معلومات جهة الاتصال.

source: Save changes
ar: حفظ التغييرات

# noContactsYetDesc
source: You don’t have any contacts yet. Add your Blink contacts while sending money
ar: ما عندك معارف حالياً. رح تقدر تضيفهم لقائمتك لما تحوللهم الأموال.

source: Profile Settings
ar: الإعدادات الشخصية

source: Log out
ar: تسجيل الخروج

# wentWrongWhileLogin
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-014)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-014)

# errorGetAccountDetails
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-072)
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-072)

source: Account Not Found
ar: الحساب غير موجود

# invalidOtpEntered
source: You have entered an invalid OTP code, please enter a valid one
ar: كلمة المرور OTP اللي دخلتها غير صحيحة. الرجاء إدخال كلمة صحيحة.
