Repository: Suheb786/crossRepoPushTest
Catalog: lib/l10n/intl_*.arb
Languages: ar

# selectFutureDate
source: Please select future date
ar: التاريخ غير صحيح. الرجاء إدخال تاريخ من المستقبل.

# invalidGenderValue
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-124)
ar: عفواً! صارخطأ. حاول كمان مرة بعدين أو تواصل معنا على التطبيق أو بالاتصال على 06-5200100 . (Err-124)

# invalidScheduleTime
source: Please select a valid date in the future
ar: الوقت غير صحيح. حاول كمان مرة.

# firebaseConnectionIssue
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-126)

# callRecordNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-127)

# niHandlerError
source: We apologies, you are not eligible to a credit card at the moment. You can still enjoy the benefits of our services.
ar: بنعتذر منك، إنت غير مؤهل للحصول على بطاقة ائتمانية بهاللحظة. بتقدر تتمتع بكل خدماتنا الأخرى.

# loanValuesError
source: Error while getting Loan Values
ar: خطأ خلال الحصول على قيم القروض

# inValidLoanValueId
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-130)

# inValidCreditLimit
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-131)

# loanValueProcessError
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-132)

# loanValueRequestProcessingError
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-133)

# invalidCustomerId
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-134)

# invalidCreditCardId
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-135)

# step2Complete
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-136)

# loanStepNotDone
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-137)

# loanValuesNotFound
source: An error occurred while issuing your Rebellious Red credit card. Please try again later.
ar: خطأ خلال إصدار بطاقتك الائتمانية Rebellious Red. حاول كمان مرة بعدين. (Err-138)

# errorInMessage
source: Error in manage so api
ar: خطأ في إدارة API

# cridUpdateError
source: Error in crif update
ar: خطأ في تحديث الشهادة

# armexApiError
source: Error in aramex api
ar: خطأ في API أرامكس

# invalidPayBackAmount
source: The Pay Back amount you've entered exceeds your account balance. Please add money to your acount or choose another amount.
ar: مبلغ السداد بيتجاوز رصيد الحساب. الرجاء إيداع المبلغ بالحساب أو اختيار حساب آخر.

# creditCardDataNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-143)

# accountClaimNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-144)

# cardLoanAccNotFound
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-145)

# paymentCashbackError
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-146)

# registeringUserToVKeyError
source: Error while registering user to vkey
ar: خطأ خلال تسجيل المستخدم

# nullId
source: Id is null from Vkey
ar: المعرف فارغ من Vkey

# assignTokenError
source: Error while assigning token vkey
ar: خطأ أثناء تعيين الرمز المميز vkey

# tokenSerialApnEmpty
source: TokenSerial / Apin is empty from Vkey
ar: TokenSerial / Apin فارغ من Vkey

source: Pin Required
ar: أدخل الرمز السري PIN

source: Invalid MessageId
ar: رسالة غير صالحة

source: Vkey transaction failed
ar: فشل حركة Vkey

# vKeyMessageIdRequired
source: Vkey Message Id is Required
ar: معرف رسالة Vkey مطلوبة

# loginNotAllowed
source: YOur Token is Expired, Login is Not Allowed
ar: الرمز منتهي الصلاحية، غير مصرح بتسجيل الدخول

# enterDetails
source: Please enter missing information.
ar: أدخل المعلومات الناقصة

# imageNull
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06

# proofRequired
source: Please upload required documents.
ar: حمّل الوثائق المطلوبة

# otpNull
source: Please enter valid code.
ar: أدخل الكود الصحيح

# deviceIsRequired
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-0005)

# videoCallDueNow
source: Your video call is due now. Swipe to initiate the call when you’re ready.
ar: صار وقت مكالمة الفيديو. اسحب الشاشة لتبدأ المكالمة لما تكون جاهز.

source: Reschedule the call
ar: تحديد موعد للمكالمة

# videoCallScheduledDateTime
source: Your video call is scheduled for the 15th of October at 10:00AM.
ar: تم تحديد موعد مكالمتك بتاريخ 15/11/2022 على الساعة 10 صباحاً

# missedVideoCall
source: Sorry, you’ve missed your video call session. Please reschedule.
ar: عفواً! راح موعد مكالمة الفيديو. الرجاء تحديد موعد جديد.

source: Are you sure you entered your
ar: متأكد من إنك أدخلت

source: ANNUAL
ar: الدخل سنوي ؟

# makeSureItsAnnualNotMonthly
source: income? Make sure it’s not your monthly income to get your credit card right away.
ar: تأكد إنك ما دخّلت الدخل الشهري بالغلط لتحصل على بطاقتك الائتمانية.

source: Empty Card No
ar: رقم بطاقة فارغ

source: Update required
ar: التحديث مطلوب

# updateRequiredDesc
source: A newer version is available. Please update Blink to continue using the services.
ar: الإصدار الجديد صار متوفر. الرجاء تحديث Blink للاستمرار باستخدام الخدمات.

# creditCardIssuanceFailure
source: Oops.. Seems that there’s an issue retrieving your card details. Please come back later.
ar: عفواً! في مشكلة باسترداد معلومات بطاقتك. حاول كمان مرة بعدين.

# resumeCreditCardProcess
source: You are almost there! Complete your application and get your Rebellious Red credit card issued, today.
ar: قربنا نخلص! كمّل طلبك واحصل على بطاقة Rebellious Red الائتمانية اليوم.

# additionalIncomePopUpDesc1
source: Make sure you enter your
ar: تأكد من إنك دخّلت

source: YEARLY
ar: الدخل السنوي

# additionalIncomePopUpDesc2
source: additional income instead of monthly income to get your credit card right away.
ar: الإضافي بدل الدخل الشهري لتحصل على بطاقتك الائتمانية الصحيحة.

# resumeCreditCardText
source: Resume application
ar: إستئناف الطلب

source: Credit Bureau Authorization
ar: تفويض وحدة الائتمان

# creditBureauAuthorizationDesc
source: I hereby irrevocably authorize Blink to retrieve my Credit Bureau data and inquire about all credit facilities granted to me by other banks and financial institutions including, but not limited to, all related terms, conditions, collateral, repayment schedule, and any changes applied to them from time to time; from any official licensed credit bureau companies in accordance with Credit Information Law dated 2010, for the purpose of (a) granting me a credit card limit along with any future increase to the limit, restructuring, changes to the credit card terms and conditions, or (b) inquiring about the reasons of any payment delay or default. I reserve the right to view my credit information, correct any wrongful information, or object to it.
ar: أفوض Blink بشكل غير قابل للنقض بالحصول على بياناتي الائتمانية والاستفسار عن جميع التسهيلات الائتمانية الممنوحة لي من قبل البنوك والمؤسسات المالية الأخرى، بما في ذلك على سبيل المثال لا الحصر جميع الشروط والأحكام والضمانات والجداول الزمنية للسداد وأي تغييرات تطرأ عليها من وقت لآخر من أي جهة ائتمانية مرخصة رسمياً وفقاً لقانون المعلومات الائتمانية لعام 2010، وذلك لغرض (أ) منحي سقفاً لبطاقتي الائتمانية إلى جانب أي زيادة مستقبلية للحد الأقصى أو إعادة هيكلة أو تغييرات في شروط وأحكام البطاقة الائتمانية. أو (ب) الاستفسار عن أسباب أي تأخير أو تقصير في السداد. أحتفظ بالحق في الاطلاع على معلوماتي الائتمانية أو تصحيح أي معلومات خاطئة أو الاعتراض عليها.

# invalidPrimaryId
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100.
ar: عفواً! صار خطأ. حاول كمان مرة أو تواصل معنا من التطبيق أو بالاتصال على 5200100-06 (Err-147)

# scanIdToProceedFurther
source: Scan your Id to proceed further.
ar: امسح هويتك عشان تكمّل

source: Transaction History
ar: سجل الحركات

# debitCardReadyDesc
source: Aramex will contact you soon to deliver your physical card. You will receive your card PIN via SMS. You can contact our Engagement Team in case not received.
ar: رح يتواصلوا معك من أرامكس قريباً، ورح يوصلك الرمز السري PIN برسالة SMS. تواصل معنا إذا ما وصلتك البطاقة.

# atmLimitExceeded
source: Atm withdrawal limit exceeded.
ar: تم تجاوز سقف السحب من الصراف الآلي

# merchantPaymentValueExceeded
source: Merchant payment limit exceeded.
ar: تم تجاوز سقف الدفع في المتاجر

# onlinePurchaseExceeded
source: Online purchase limit exceeded.
ar: تم تجاوز سقف الشراء أونلاين

# noInternetConnection
source: Service is Unavailable
ar: الخدمة غير متاحة

# serverUnderMaintenance
source: Server is under maintenance. Please try again in sometime.
ar: السيرفر تحت الصيانة، حاول بعدين.

# debitCardDeliveredQ
source: Debit Card delivered?
ar: وصلتك بطاقة الدفع المباشر؟

# creditCardDeliveredQ
source: Credit card delivered?
ar: وصلتك البطاقة الائتمانية؟

# creatingSuppCreditLimit
source: Creating your supplementary credit card limit
ar: إنشاء سقف لبطاقتك الائتمانية التابعة

# issuingSuppCreditCard
source: Issuing your supplementary credit card
ar: إصدار بطاقتك الائتمانية التابعة

# activatingSuppCreditCard
source: Activating your supplementary credit card
ar: تفعيل بطاقتك الائتمانية التابعة

source: Connection Failed
ar: فشل في الاتصال

source: REQUEST TIMEOUT
ar: انتهى وقت الطلب

source: Transaction Type
ar: نوع الحركة

source: Payment Period
ar: فترة الدفعة

source: From Me
ar: لي

source: Oops! Your card is not active
ar: بطاقتك غير فعالة

# youEitherChangePinOrUnBlocked
source: You either changed your PIN or unblocked it, please visit the nearest ATM to activate your new PIN
ar: الرقم السري تغير، زور أقرب صراف آلي لحتى تفعله

# idVerificationFailed177
source: ID verification failed, can’t proceed err:177
ar: فشل في التحقق من الهوية، لا يمكن الاستمرار.: 177

# idVerificationFailed178
source: ID verification failed, can’t proceed err:178
ar: فشل في التحقق من الهوية، لا يمكن الاستمرار.: 178

source: Apply now
ar: قدّم الآن

source: Application submitted
ar: تم تقديم الطلب

# applicationSubmittedDesc
source: To complete your credit card application, you are required to verify yourself via video call.
ar: لتكمّل طلب البطاقة الائتمانية، لازم نحكي معك فيديو للتحقق.

source: APPLY FOR CREDIT CARD
ar: قدّم لبطاقتك الائتمانية

# timeForQuickVideoCall
source: It’s time for a quick video call
ar: صار الوقت لمكالمة فيديو سريعة

# verificationCallEnded
source: Verification call has ended
ar: انتهت مكالمة التحقق

# verificationCallEndedDesc
source: Call is completed. You’ll be notified on the application status.
ar: اكتملت المكالمة. رح نبلغك بحالة الطلب.

# verifyViaVideoCallCC
source: You can call us between 10:00am and 6:00pm to complete your application. We may ask for proof of occupation, kindly have it ready.
ar: تواصل معنا لتستكمل الطلب بين الساعة ١٠:٠٠ص و ٦:٠٠م. ممكن نطلب إثبات عمل، يا ريت يكون معك عند الاتصال.

# verifyNow
source: Start video call
ar: ابدأ مكالمة الفيديو

# creditCardApplicationUnderReviewDesc
source: Your application is being reviewed. You’ll be notified soon.
ar: طلبك قيد المراجعة. رح نبلغك بالتفاصيل قريباً.

# getCreditCardNowDesc
source: Your application has been approved. Time to get your card ready!
ar: تمت الموافقة على طلبك. صار وقت اصدار البطاقة.

# applicationRejectedByEngagementTeam
source: Our Engagement Team are unable to approve your application as it does not meet Blink’s Terms & Conditions.
ar: لم يتم الموافقة على طلبك

# agentNotAvailable
source: Engagement team is currently not available, please try later
ar: فريقنا غير متاح حالياً، حاول بعدين.

# youCanAddMoney
source: You can add money to your account and start using your virtual Yellow Sun debit card immediately.
ar: بتقدر تودع الأموال بحسابك وتبدأ باستخدام بطاقة الدفع المباشر Yellow Sun مباشرة.

# creditCardServicesUnavailable
source: Credit card applications are temporarily unavailable, we are working hard to meet existing demand and will be back soon.
ar: طلبات البطاقات الائتمانية غير متاحة حالياً، عم نشتغل بكل طاقتنا لتلبية الطلبات الحالية ورح نرجعلك قريباً.

source: Request via QR
ar: طلب أموال من خلال رمز الاستجابة السريع QR

source: Select Account
ar: اختار الحساب

# savingAccount
source: Savings Account {accountNo}
ar: حساب التوفير {accountNo}

source: QR PAYMENTS
ar: دفعات QR

# showQrForScanning
source: Please show your QR for scanning
ar: اعرض رمز QR لمسحه

source: Share QR
ar: شارك رمز QR

source: AMOUNT
ar: المبلغ

# youAreAcceptingMoneyRequestViaQr
source: You are accepting a money request via QR
ar: تم قبول طلب الأموال من خلال QR

source: Pay from
ar: تسديد من

source: Manage CliQ ID
ar: إدارة CliQ

# NoCliqContactYet
source: You don’t have any CliQ ID. Create your first one via Blink.
ar: ما عندك رقم CliQ. أنشئ حسابك الأول من خلال Blink

source: Create CliQ ID
ar: إنشاء CliQ

source: CREATE NEW cliq ID
ar: إنشاء CliQ جديد

# letsCreateNewCliqId
source: Let’s create your new CliQ ID
ar: خلينا نعمل CliQ جديد

source: CliQ ID Type
ar: نوع حساب CliQ

source: Link bank account to your new ID
ar: اربط حسابك البنكي مع حساب CliQ الجديد

source: Alias
ar: الاسم المستعار

# emptyCliqIdType
source: Please Select cliq Id Type
ar: اختار نوع حساب CliQ

# emptyAlias
source: Please Enter Alias
ar: أدخل الاسم المستعار

source: Add link account
ar: أضف حساب مرتبط

# cliqIdCreateSuccessFully
source: CliQ ID created successfully
ar: تم إنشاء CliQ بنجاح

source: Share CliQ ID
ar: شارك CliQ

# toManageCliq
source: to Manage CliQ ID
ar: إدارة CliQ

source: Set as Default
ar: التعيين كحساب اساسي

source: Unlink Account
ar: فك ربط الحساب

source: Edit ID
ar: تعديل نوع الحساب

source: Share ID
ar: مشاركة معلومات CLIQ

source: Suspend ID
ar: حساب موقوف

source: Delete CliQ ID
ar: حذف حساب CliQ

source: EDIT CLIQ ID
ar: تعديل حساب CliQ

source: Edit your alias
ar: تعديل الاسم المستعار

# editYourMobileNo
source: Edit your mobile number
ar: تعديل رقم الموبايل

# viewCardSubscription
source: View card subscriptions
ar: استعراض اشتراكات البطاقة

source: Change credit limit
ar: تغيير سقف البطاقة

# convertPurchaseToInstallments
source: Convert purchases to instalments
ar: تقسيط المشتريات

# replaceDamageCard
source: Replace damaged card
ar: استبدال بطاقة تالفة

# changeCardRestrictionDesc
source: Your card will be restricted in below listed country of your selection.
ar: رح يتم تقييد بطاقتك في الدولة المذكورة أدناه حسب اختيارك

# addCountryRestriction
source: Add Country Restrictions
ar: إضافة تقييدات على مسنوى الدول

source: Blocked Countries
ar: دول محظورة

# notSetUpCountryRestrictionYet
source: You have not set up any country restrictions yet
ar: لساتك ما اخترت تقييدات على مسنوى الدول

source: Block this country?
ar: حظر هاي الدولة؟

# blockThisCountryDesc
source: If you block a country, any transaction made within that country will be declined and you will have to lift the blocked before any payments.
ar: إذا تم حظر دولة، فأي حركة بتعملها فيها رح يتم رفضها ولازم تفك الحظر عشان تقدر تكمّل دفعاتك.

source: Change card payment account
ar: تغيير حساب الدفع للبطاقة

source: Change settlement options
ar: تغيير نسبة السداد

# selectAccountToPayCreditCard
source: Select account to pay your credit card
ar: اختار الحساب اللي بدك تدفع منه لبطاقتك الائتمانية

source: Current Settlement Account
ar: حساب التسوية الحالي

source: New settlement account
ar: حساب التسوية الجديد

# cardDetailsUpdated
source: Card details updated successfully
ar: تم تحديث معلومات البطاقة بنجاح

# cardDetailsUpdatedDesc
source: Your credit card settlement account has been updated with your new selected account
ar: تم تحديث حساب تسوية بطاقتك الائتمانية بالحساب الجديد بنجاح

# selectNewPercentage
source: Select new settlement percentage for your next payment cycle
ar: اختار نسبة تسوية جديدة لدورة الدفع الجاية

source: Current Settlement Percentage
ar: نسبة السداد الحالية

source: New settlement Percentage
ar: نسبة السداد الجديدة

# settlementPercentage
source: Settlement Percentages
ar: نسب السداد

# creditSettlementPercentageChangedDesc
source: Your credit card settlement percentages has been updated with your new selected account
ar: تم تحديث نسب السداد لبطاقتك الائتمانية بالحساب الجديد اللي اخترته بنجاح

# subscription
source: subscriptions
ar: الاشتراكات

# viewCardSubSubscription
source: View card subscriptions
ar: استعراض اشتراكات البطاقة

# receiveOtpToNewNumber
source: You will receive OTP to your new number for future transactions.
ar: رح توصلك كلمة مرور OTP على موبايلك للحركات المستقبلية

source: NEW MOBILE NUMBER
ar: رقم موبايل جديد

# changeMobileNumberInfo
source: Changing the mobile number is only for notification relating to this card. If you wish to change the mobile number relating to account, please go to Profile Settings.
ar: رح يتم تغيير الرقم فقط للاشعارات المتعلقة بالبطاقة. بتقدرى تغيّر الرقم المرتبط بالحساب من خلال إعدادات الحساب.

# dcEnterOtpHeader
source: Enter 6-digit OTP sent to
ar: أدخل كلمة مرور OTP المكونة من 6 أرقام

# cardDetailUpdated
source: Card details updated successfully
ar: تم تحديث معلومات البطاقة بنجاح

# dcMobileNumberUpdated
source: Your new mobile number has been successfully verified and tied to your card transactions.
ar: تم التحقق من رقم الموبايل الجديد بنجاح وربطه بحركات البطاقة.

# linkedAccountDebited
source: Linked account is debited whenever transaction made using this card
ar: رح يتم القيد من الحساب المرتبط لأي حركة بتنعمل من على هاي البطاقة

# reportStolenCardInfo
source: Are you sure you would like to proceed? This will cancel you card but don’t worry, we will immediately issue a new one.
ar: متأكد من الاستمرار؟ رح يتم إلغاء بطاقتك، بس ما تقلق رح نصدرلك بطاقة جديدة فوراً.

# yourCardIssued
source: Your card has been issued
ar: تم إصدار بطاقتك

# cardSubscription
source: Card subscriptions
ar: اشتراكات البطاقة

# subscriptionPopUpInfo
source: Please remember that the card you reported as stolen/lost had the following subscription. You will need to update you subscription with your new card details.
ar: تذكر إنه البطاقة اللي بلّغت عن سرقتها/ ضياعها عليها الاشتراك التالي. رح تحتاج تحدّث اشتراكك ببطاقتك الجديدة.

# toViewSubscription
source: to View Subscriptionss
ar: لاستعراض الاشتراكات

# renewNewCreditCard
source: RENEW CREDIT CARD
ar: تجديد البطاقة الائتمانية

# youCanChangeCardDetailsInSettings
source: You can change the above details in the card settings
ar: بتقدر تغيّر المعلومات أعلاه من خلال إعدادات البطاقة

source: CARD SETTLEMENT ACCOUNT
ar: حساب تسوية البطاقة

# reportStolenLostCardDesc
source: Are you sure you would like to proceed? this will cancel your card but don’t worry, we will immediately issue a new one. You will have to add your new card to Apple Pay if you wish to use the service.
ar: .متأكد من ألإستمرار ؟ رح يتم إلغاء بطاقتك. بس ما تقلق راح نصدرلك بطاقة جديده فوراً .لازم تضيف بطاقتك على خدمة أبل باي إذا كنت ترغب في استخدام الخدمة

# changeCreditLimitDesc
source: Adjust your desired credit limit
ar: اضبط سقف البطاقة الائتمانية المطلوب

# creditLimitChangedSuccess
source: Credit limit is successfully updated
ar: تم تحديث سقف الائتمان بنجاح

# creditLimitChangedDesc
source: New credit limit has been set for your credit card.
ar: تم وضع سقف ائتماني جديد لبطاقتك الائتمانية

# selectPreferredInstallmentDuration
source: Select your preferred instalment duration
ar: اختار مدة التقسيط المفضلة

# installmentOption
source: Instalment Options
ar: خيارات التقسيط

# purchaseInstallmentsSuccessfullySet
source: Purchase instalment is successfully set
ar: تم تقسيط المشتريات بنجاح

# purchaseInstallmentsSuccessfullySetDesc
source: Your purchase has been set for instalment. The first instalment of 44.57 JOD will be charged on 27 Nov 2021.
ar: تم تقسيط مشترياتك. القسط الأول بقيمة 44.57 دينار رح يكون مستحق يوم 27/11/2021

source: Replace damaged card
ar: استبدال بطاقة تالفة

source: Report damaged card
ar: الإبلاغ عن بطاقة تالفة

# noPlaceholderFound
source: No Placeholder Record Found against this Id
ar: لم يتم العثور على سجل عنصر نائب مقابل هذا المعرف

# placeholderIdNull
source: PlaceHolder Id is null
ar: معرف PlaceHolder فارغ

# relationNull
source: Invalid relationship! Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-0008)
ar: علاقة غير صحيحة! يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو ابنك أو والدك (Err-0008)

# ahwalFailed
source: Oops! Something went wrong. Please try again later or contact our Engagement Team from the app or call 06-5200100. (Err-301)
ar: عفواً! صارخطأ. حاول كمان مرة بعدين أو تواصل معنا على التطبيق أو بالاتصال على 06-5200100 . (Err-301)

# invalidRelation
source: Invalid relationship! Please ensure that the supplemntary cardholder is your spouse, child or parent.(Err-302)
ar: علاقة غير صحيحة! يرجى التأكد من أن حامل البطاقة الإضافي هو زوجتك أو طفلك أو والديك. (Err-302)

# primaryIdNotMatchWithGroom
source: Invalid relationship. Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-303)
ar: علاقة غير صحيحة. يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والديك. (Err-303)

# suppIdNotMatchWIthMotherFather
source: Invalid relationship. Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-304)
ar: علاقة غير صحيحة. يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والديك. (Err-304)

# primaryDebitCardIdNotMatchWithMotherFather
source: Invalid relationship. Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-305)
ar: علاقة غير صحيحة. يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والديك. (Err-305)

# relationShipNull
source: Invalid relationship! Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-0009)
ar: علاقة غير صحيحة! يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والدك (Err-0009)

# invalidRelationshipAPI
source: Invalid relationship. Please ensure that the supplementary cardholder is your spouse, child or parent.(Err-306)
ar: علاقة غير صحيحة. يرجى التأكد من أن حامل البطاقة الإضافية هو زوجتك أو طفلك أو والديك. (Err-306)
